@php

$array[] = array('amount' => '43247', 'description' => '01.01.2020', 'user' => 'Моисеев Денис Валерьевич', 'date' => '19.10.2020', 'paid' => '6684,47');
$array[] = array('amount' => '72764,76', 'description' => '01.01.2020', 'user' => 'Долматов Алексей Леонидович', 'date' => '19.10.2020', 'paid' => '11412,05');
$array[] = array('amount' => '18485', 'description' => '01.01.2020', 'user' => 'Субботин Сергей Александрович', 'date' => '19.10.2020', 'paid' => '2882,85');
$array[] = array('amount' => '105391', 'description' => '01.01.2020', 'user' => 'Токарев Алексей Викторович', 'date' => '19.10.2020', 'paid' => '16313,35');
$array[] = array('amount' => '67393', 'description' => '01.01.2020', 'user' => 'Токарева Татьяна Александровна', 'date' => '19.10.2020', 'paid' => '10415,05');
$array[] = array('amount' => '14007', 'description' => '01.01.2020', 'user' => 'Белов Алексей Николаевич', 'date' => '19.10.2020', 'paid' => '2197,8');
$array[] = array('amount' => '34732,88', 'description' => '01.01.2020', 'user' => 'Желтухин Михаил Владимирович', 'date' => '19.10.2020', 'paid' => '5394,46');
$array[] = array('amount' => '22282,19', 'description' => '01.01.2020', 'user' => 'Рогалев Максим Андреевич', 'date' => '19.10.2020', 'paid' => '3495,99');
$array[] = array('amount' => '238226', 'description' => '01.01.2020', 'user' => 'Седов Евгений Николаевич', 'date' => '19.10.2020', 'paid' => '37401,66');
$array[] = array('amount' => '271670,41', 'description' => '01.01.2020', 'user' => 'Попова Галина Михайловна', 'date' => '19.10.2020', 'paid' => '42290,8');
$array[] = array('amount' => '119640,14', 'description' => '01.01.2020', 'user' => 'Будаев Андрей Игоревич', 'date' => '19.10.2020', 'paid' => '18589,05');
$array[] = array('amount' => '77695,73', 'description' => '01.01.2020', 'user' => 'Юзгина Ольга Альбертовна', 'date' => '19.10.2020', 'paid' => '12047,63');
$array[] = array('amount' => '102019,53', 'description' => '01.01.2020', 'user' => 'Дягилев Юрий Николаевич', 'date' => '19.10.2020', 'paid' => '15826,72');
$array[] = array('amount' => '30316', 'description' => '01.01.2020', 'user' => 'Веселкова Нина Николаевна', 'date' => '19.10.2020', 'paid' => '4723,28');
$array[] = array('amount' => '81219,98', 'description' => '01.01.2020', 'user' => 'Исаковский Иван Васильевич', 'date' => '19.10.2020', 'paid' => '12550,07');
$array[] = array('amount' => '69836,62', 'description' => '01.01.2020', 'user' => 'Хапов Юрий Валентинович', 'date' => '19.10.2020', 'paid' => '10850,8');
$array[] = array('amount' => '85546,53', 'description' => '01.01.2020', 'user' => 'Жиганов Александр Лаврентьевич', 'date' => '19.10.2020', 'paid' => '13432,78');
$array[] = array('amount' => '150238,8', 'description' => '01.01.2020', 'user' => 'Залесский Дмитрий Анатольевич', 'date' => '19.10.2020', 'paid' => '23261,21');
$array[] = array('amount' => '85242,64', 'description' => '01.01.2020', 'user' => 'Щеглов Алексей Викторович', 'date' => '19.10.2020', 'paid' => '13292,89');
$array[] = array('amount' => '7321,01', 'description' => '01.01.2020', 'user' => 'Смирнов Юрий Александрович', 'date' => '19.10.2020', 'paid' => '1141,75');
$array[] = array('amount' => '232020', 'description' => '01.01.2020', 'user' => 'Трунин Андрей Геннадьевич', 'date' => '19.10.2020', 'paid' => '36052,87');
$array[] = array('amount' => '112898,07', 'description' => '01.01.2020', 'user' => 'Красильников Анатолий Николаевич', 'date' => '19.10.2020', 'paid' => '17705,76');
$array[] = array('amount' => '25302,59', 'description' => '01.01.2020', 'user' => 'Бушманова Вера Геннадьевна', 'date' => '19.10.2020', 'paid' => '3972,58');
$array[] = array('amount' => '127669,62', 'description' => '01.01.2020', 'user' => 'Шнуров Игорь Алексеевич', 'date' => '19.10.2020', 'paid' => '19730,52');
$array[] = array('amount' => '46479', 'description' => '01.01.2020', 'user' => 'Кузнецов Александр Александрович', 'date' => '19.10.2020', 'paid' => '7266,48');
$array[] = array('amount' => '73506,64', 'description' => '01.01.2020', 'user' => 'Савченко Ирина Сергеевна', 'date' => '19.10.2020', 'paid' => '11468,82');
$array[] = array('amount' => '68925,4', 'description' => '01.01.2020', 'user' => 'Маслова Валентина Юрьевна', 'date' => '19.10.2020', 'paid' => '10777,89');
$array[] = array('amount' => '5152,62', 'description' => '01.01.2020', 'user' => 'Смирнова Анна Евгеньевна', 'date' => '19.10.2020', 'paid' => '803,58');
$array[] = array('amount' => '73224,87', 'description' => '01.01.2020', 'user' => 'Постников Вадим Валентинович', 'date' => '19.10.2020', 'paid' => '11446,17');
$array[] = array('amount' => '123379,13', 'description' => '01.01.2020', 'user' => 'Свечинова Любовь Андреевна', 'date' => '19.10.2020', 'paid' => '19333,47');
$array[] = array('amount' => '65785,42', 'description' => '01.01.2020', 'user' => 'Сочнева Анна Алексеевна', 'date' => '19.10.2020', 'paid' => '10270,78');
$array[] = array('amount' => '112496,35', 'description' => '01.01.2020', 'user' => 'Логинов Геннадий Валерианович', 'date' => '19.10.2020', 'paid' => '17405,62');
$array[] = array('amount' => '115223,02', 'description' => '01.01.2020', 'user' => 'Смыслов Сергей Валентинович', 'date' => '19.10.2020', 'paid' => '17827,43');
$array[] = array('amount' => '110120,93', 'description' => '01.01.2020', 'user' => 'Миронова Ирина Леонидовна', 'date' => '19.10.2020', 'paid' => '17106,95');
$array[] = array('amount' => '82106,08', 'description' => '01.01.2020', 'user' => 'Родионов Сергей Викторович', 'date' => '19.10.2020', 'paid' => '12840,46');
$array[] = array('amount' => '112645,71', 'description' => '01.01.2020', 'user' => 'Круглов Николай Александрович', 'date' => '19.10.2020', 'paid' => '17420,72');
$array[] = array('amount' => '107552,47', 'description' => '01.01.2020', 'user' => 'Коновалова Алла Васильевна', 'date' => '19.10.2020', 'paid' => '16678,91');
$array[] = array('amount' => '148123,66', 'description' => '01.01.2020', 'user' => 'Леонов Владимир Валерьевич', 'date' => '19.10.2020', 'paid' => '22965,66');
$array[] = array('amount' => '100535,24', 'description' => '01.01.2020', 'user' => 'Богданов Алексей Емельянович', 'date' => '19.10.2020', 'paid' => '15580,75');
$array[] = array('amount' => '38629,98', 'description' => '01.01.2020', 'user' => 'Креузова Валентина Петровна', 'date' => '19.10.2020', 'paid' => '6035,77');
$array[] = array('amount' => '77024,61', 'description' => '01.01.2020', 'user' => 'Барышев Игорь Николаевич', 'date' => '19.10.2020', 'paid' => '12055,01');
$array[] = array('amount' => '366171,22', 'description' => '01.01.2020', 'user' => 'Бодунов Артем Вячеславович', 'date' => '19.10.2020', 'paid' => '57434,3');
$array[] = array('amount' => '85355,13', 'description' => '01.01.2020', 'user' => 'Борисов Алексей Владимирович', 'date' => '19.10.2020', 'paid' => '13287,71');
$array[] = array('amount' => '3695', 'description' => '01.01.2020', 'user' => 'Буров Алексей Николаевич', 'date' => '19.10.2020', 'paid' => '574,35');
$array[] = array('amount' => '8972,81', 'description' => '01.01.2020', 'user' => 'Быков Андрей Анатольевич', 'date' => '19.10.2020', 'paid' => '1399,36');
$array[] = array('amount' => '7370,62', 'description' => '01.01.2020', 'user' => 'Владычанская Анна Витальевна', 'date' => '19.10.2020', 'paid' => '1149,49');
$array[] = array('amount' => '6144,17', 'description' => '01.01.2020', 'user' => 'Гаркуша Андрей Владимирович', 'date' => '19.10.2020', 'paid' => '963,93');
$array[] = array('amount' => '154988,49', 'description' => '01.01.2020', 'user' => 'Дикарев Альберт Вениаминович', 'date' => '19.10.2020', 'paid' => '24086,06');
$array[] = array('amount' => '54530,49', 'description' => '01.01.2020', 'user' => 'Долгов Андрей Валерьевич', 'date' => '19.10.2020', 'paid' => '8437,96');
$array[] = array('amount' => '91705', 'description' => '01.01.2020', 'user' => 'Калинин Алексей Валерьевич', 'date' => '19.10.2020', 'paid' => '14189,01');
$array[] = array('amount' => '81495,59', 'description' => '01.01.2020', 'user' => 'Калининский Евгений Валентинович', 'date' => '19.10.2020', 'paid' => '12610,75');
$array[] = array('amount' => '40749,45', 'description' => '01.01.2020', 'user' => 'Малышев Александр Сергеевич', 'date' => '19.10.2020', 'paid' => '6331,03');
$array[] = array('amount' => '80103,02', 'description' => '01.01.2020', 'user' => 'Митин Сергей Вадимович', 'date' => '19.10.2020', 'paid' => '12560,17');
$array[] = array('amount' => '15736,59', 'description' => '01.01.2020', 'user' => 'Молотобойцев Денис Юрьевич', 'date' => '19.10.2020', 'paid' => '2454,21');
$array[] = array('amount' => '3348', 'description' => '01.01.2020', 'user' => 'Морозов Владимир Валерьевич', 'date' => '19.10.2020', 'paid' => '525,8');
$array[] = array('amount' => '4033,56', 'description' => '01.01.2020', 'user' => 'Пантелеев Евгений Николаевич', 'date' => '19.10.2020', 'paid' => '626,97');
$array[] = array('amount' => '6004', 'description' => '01.01.2020', 'user' => 'Пантелеева Наталья Михайловна', 'date' => '19.10.2020', 'paid' => '932,2');
$array[] = array('amount' => '5374,28', 'description' => '01.01.2020', 'user' => 'Пятакова Елена Михайловна', 'date' => '19.10.2020', 'paid' => '837,42');
$array[] = array('amount' => '396407,07', 'description' => '01.01.2020', 'user' => 'Седов Николай Мартьянович', 'date' => '19.10.2020', 'paid' => '61556,02');
$array[] = array('amount' => '85727,08', 'description' => '01.01.2020', 'user' => 'Сивкова Татьяна Васильевна', 'date' => '19.10.2020', 'paid' => '13326,31');
$array[] = array('amount' => '69664,9', 'description' => '01.01.2020', 'user' => 'Сухарев Валерий Николаевич', 'date' => '19.10.2020', 'paid' => '10793,79');
$array[] = array('amount' => '82244,6', 'description' => '01.01.2020', 'user' => 'Тропин Николай Феодосьевич', 'date' => '19.10.2020', 'paid' => '12820,18');
$array[] = array('amount' => '127337,89', 'description' => '01.01.2020', 'user' => 'Тухов Лев Николаевич', 'date' => '19.10.2020', 'paid' => '19845,91');
$array[] = array('amount' => '68453,72', 'description' => '01.01.2020', 'user' => 'Бурдюг Денис Владимирович', 'date' => '19.10.2020', 'paid' => '10706,65');
$array[] = array('amount' => '87707,08', 'description' => '01.01.2020', 'user' => 'Порохова Галина Валентиновна', 'date' => '19.10.2020', 'paid' => '13570,59');
$array[] = array('amount' => '70651,96', 'description' => '01.01.2020', 'user' => 'Паничев Геннадий Валерьевич', 'date' => '19.10.2020', 'paid' => '10920,35');
$array[] = array('amount' => '22515', 'description' => '01.01.2020', 'user' => 'Михеева Анна Николаевна', 'date' => '19.10.2020', 'paid' => '3511,35');
$array[] = array('amount' => '47026', 'description' => '01.01.2020', 'user' => 'Шилова Елена Олеговна', 'date' => '19.10.2020', 'paid' => '7333,41');
$array[] = array('amount' => '87160,61', 'description' => '01.01.2020', 'user' => 'Уклеина Нелли Юрьевна', 'date' => '19.10.2020', 'paid' => '13497,36');
$array[] = array('amount' => '10335,5', 'description' => '01.01.2020', 'user' => 'Снятков Евгений Сергеевич', 'date' => '19.10.2020', 'paid' => '1611,88');
$array[] = array('amount' => '110658,36', 'description' => '01.01.2020', 'user' => 'Новиков Владимир Сергеевич', 'date' => '19.10.2020', 'paid' => '17269,15');
$array[] = array('amount' => '175250', 'description' => '01.01.2020', 'user' => 'Матюшин Александр Леонидович', 'date' => '19.10.2020', 'paid' => '27189,98');
$array[] = array('amount' => '103646,86', 'description' => '01.01.2020', 'user' => 'Красильников Александр Николаевич', 'date' => '19.10.2020', 'paid' => '16024,22');
$array[] = array('amount' => '110911,62', 'description' => '01.01.2020', 'user' => 'Киселев Василий Павлович', 'date' => '19.10.2020', 'paid' => '17194,14');
$array[] = array('amount' => '38712,27', 'description' => '01.01.2020', 'user' => 'Ершов Виктор Владимирович', 'date' => '19.10.2020', 'paid' => '6027,81');
$array[] = array('amount' => '139182,72', 'description' => '01.01.2020', 'user' => 'Егоров Валерий Вадимович', 'date' => '19.10.2020', 'paid' => '21510,64');
$array[] = array('amount' => '52978,95', 'description' => '01.01.2020', 'user' => 'Волокитин Андрей Сергеевич', 'date' => '19.10.2020', 'paid' => '8256,62');
$array[] = array('amount' => '16114,43', 'description' => '01.01.2020', 'user' => 'Бречалов Николай Алексеевич', 'date' => '19.10.2020', 'paid' => '2499,45');
$array[] = array('amount' => '96162', 'description' => '01.01.2020', 'user' => 'Борисов Сергей Николаевич', 'date' => '19.10.2020', 'paid' => '14891,29');
$array[] = array('amount' => '39721,89', 'description' => '01.01.2020', 'user' => 'Борисов Алексей Алексеевич', 'date' => '19.10.2020', 'paid' => '6221,33');
$array[] = array('amount' => '390115,32', 'description' => '01.01.2020', 'user' => 'Белозеров Василий Сергеевич', 'date' => '19.10.2020', 'paid' => '60808,28');
$array[] = array('amount' => '48704,35', 'description' => '01.01.2020', 'user' => 'Лапшин Леонид Анатольевич', 'date' => '19.10.2020', 'paid' => '7592,41');
$array[] = array('amount' => '152048,66', 'description' => '01.01.2020', 'user' => 'Поляков Дмитрий Владимирович', 'date' => '19.10.2020', 'paid' => '23683,36');
$array[] = array('amount' => '76216,1', 'description' => '01.01.2020', 'user' => 'Сидоренков Иван Сергеевич', 'date' => '19.10.2020', 'paid' => '11789,81');
$array[] = array('amount' => '58095', 'description' => '01.01.2020', 'user' => 'Соколов Николай Дмитриевич', 'date' => '19.10.2020', 'paid' => '9098,33');


$users[] = ['name' => 'Белов Алексей Николаевич', 'date' => '27.04.2017'];
$users[] = ['name' => 'Белозеров Василий Сергеевич', 'date' => '18.04.2017'];
$users[] = ['name' => 'Богданов Алексей Емельянович', 'date' => '01.06.2017'];
$users[] = ['name' => 'Бодунов Артем Вячеславович', 'date' => '02.06.2017'];
$users[] = ['name' => 'Бодунов Артём Вячеславович', 'date' => '02.06.2017'];
$users[] = ['name' => 'Борисов Алексей Алексеевич', 'date' => '14.08.2017'];
$users[] = ['name' => 'Борисов Сергей Николаевич', 'date' => '01.06.2017'];
$users[] = ['name' => 'Бречалов Николай Алексеевич', 'date' => '24.04.2017'];
$users[] = ['name' => 'Будаев Андрей Игоревич', 'date' => '16.05.2017'];
$users[] = ['name' => 'Бушманова Вера Геннадьевна', 'date' => '01.06.2017'];
$users[] = ['name' => 'Быков Андрей Анатольевич', 'date' => '14.08.2017'];
$users[] = ['name' => 'Веселкова Нина Николаевна', 'date' => '14.08.2017'];
$users[] = ['name' => 'Владычанская Анна Витальевна', 'date' => '07.08.2017'];
$users[] = ['name' => 'Волокитин Андрей Сергеевич', 'date' => '01.06.2017'];
$users[] = ['name' => 'Гаркуша Андрей Владимирович', 'date' => '07.08.2017'];
$users[] = ['name' => 'Грошева Алена Николаевна', 'date' => '07.08.2017'];
$users[] = ['name' => 'Долгов Андрей Валерьевич', 'date' => '14.08.2017'];
$users[] = ['name' => 'Дягилев Юрий Николаевич', 'date' => '14.08.2017'];
$users[] = ['name' => 'Егоров Валерий Вадимович', 'date' => '01.06.2017'];
$users[] = ['name' => 'Ершов Виктор Владимирович', 'date' => '01.06.2017'];
$users[] = ['name' => 'Залесский Дмитрий Анатольевич', 'date' => '01.06.2017'];
$users[] = ['name' => 'Калинин Алексей Валерьевич', 'date' => '15.06.2017'];
$users[] = ['name' => 'Киселев Василий Павлович', 'date' => '01.06.2017'];
$users[] = ['name' => 'Коновалова Алла Васильевна', 'date' => '01.06.2017'];
$users[] = ['name' => 'Красильников Александр Николаевич', 'date' => '01.06.2017'];
$users[] = ['name' => 'Красильников Анатолий Николаевич', 'date' => '01.06.2017'];
$users[] = ['name' => 'Круглов Николай Александрович', 'date' => '01.06.2017'];
$users[] = ['name' => 'Лапшин Леонид Анатольевич', 'date' => '14.08.2017'];
$users[] = ['name' => 'Леонов Владимир Валерьевич', 'date' => '01.06.2017'];
$users[] = ['name' => 'Логинов Геннадий Валерианович', 'date' => '01.06.2017'];
$users[] = ['name' => 'Малышев Александр Сергеевич', 'date' => '14.08.2017'];
$users[] = ['name' => 'Маслова Валентина Юрьевна', 'date' => '14.08.2017'];
$users[] = ['name' => 'Матюшин Александр Леонидович', 'date' => '14.08.2017'];
$users[] = ['name' => 'Матюшин Александр Леонидович', 'date' => '14.08.2017'];
$users[] = ['name' => 'Миронова Ирина Леонидовна', 'date' => '01.06.2017'];
$users[] = ['name' => 'Миронова Наталья Валерьевна', 'date' => '03.08.2018'];
$users[] = ['name' => 'Митин Сергей Вадимович', 'date' => '14.08.2017'];
$users[] = ['name' => 'Михеева Анна Николаевна', 'date' => '10.05.2017'];
$users[] = ['name' => 'Молотобойцев Денис Юрьевич', 'date' => '14.08.2017'];
$users[] = ['name' => 'Паничев Геннадий Валерьевич', 'date' => '14.08.2017'];
$users[] = ['name' => 'Пантелеева Наталья Михайловна', 'date' => '07.08.2017'];
$users[] = ['name' => 'Пелевина Татьяна Юрьевна', 'date' => '07.08.2017'];
$users[] = ['name' => 'Пелевина Татьяна Юрьевна', 'date' => '07.08.2017'];
$users[] = ['name' => 'Попова Галина Михайловна', 'date' => '18.04.2017'];
$users[] = ['name' => 'Порохова Галина Валентиновна', 'date' => '15.03.2017'];
$users[] = ['name' => 'Постников Вадим Валентинович', 'date' => '03.07.2017'];
$users[] = ['name' => 'Рогалев Максим Андреевич', 'date' => '24.05.2017'];
$users[] = ['name' => 'Родионов Сергей Викторович', 'date' => '01.06.2017'];
$users[] = ['name' => 'Савченко Ирина Сергеевна', 'date' => '01.06.2017'];
$users[] = ['name' => 'Свечинова Любовь Андреевна', 'date' => '01.06.2017'];
$users[] = ['name' => 'Седов Евгений Николаевич', 'date' => '11.08.2017'];
$users[] = ['name' => 'Седов Евгений Николаевич', 'date' => '11.08.2017'];
$users[] = ['name' => 'Седов Николай Мартьянович', 'date' => '15.08.2017'];
$users[] = ['name' => 'Сидоренков Иван Сергеевич', 'date' => '14.08.2017'];
$users[] = ['name' => 'Слыхалов Александр Владимирович', 'date' => '07.08.2017'];
$users[] = ['name' => 'Смирнов Юрий Александрович', 'date' => '01.06.2017'];
$users[] = ['name' => 'Смирнова Анна Евгеньевна', 'date' => '01.06.2017'];
$users[] = ['name' => 'Смыслов Сергей Валентинович', 'date' => '01.06.2017'];
$users[] = ['name' => 'Снятков Евгений Сергеевич', 'date' => '29.05.2017'];
$users[] = ['name' => 'Соколов Николай Дмитриевич', 'date' => '14.08.2017'];
$users[] = ['name' => 'Сочнева Анна Алексеевна', 'date' => '01.06.2017'];
$users[] = ['name' => 'Субботин Сергей Александрович', 'date' => '14.08.2017'];
$users[] = ['name' => 'Токарев Алексей Викторович', 'date' => '31.05.2017'];
$users[] = ['name' => 'Токарева Татьяна Александровна', 'date' => '23.06.2017'];
$users[] = ['name' => 'Трунин Андрей Геннадьевич', 'date' => '30.06.2017'];
$users[] = ['name' => 'Трунин Андрей Геннадьевич', 'date' => '30.06.2017'];
$users[] = ['name' => 'Хапов Юрий Валентинович', 'date' => '01.06.2017'];
$users[] = ['name' => 'Шилов Николай Александрович', 'date' => '01.06.2017'];
$users[] = ['name' => 'Шилова Елена Олеговна', 'date' => '30.05.2017'];
$users[] = ['name' => 'Шнуров Игорь Алексеевич', 'date' => '01.06.2017'];
$users[] = ['name' => 'Щеглов Алексей Викторович', 'date' => '01.06.2017'];
$users[] = ['name' => 'Барышев Игорь Николаевич', 'date' => '13.03.2017'];
$users[] = ['name' => 'Борисов Алексей Владимирович', 'date' => '07.03.2017'];
$users[] = ['name' => 'Бурдюг Денис Владимирович', 'date' => '13.03.2017'];
$users[] = ['name' => 'Буров Алексей Николаевич', 'date' => '13.03.2017'];
$users[] = ['name' => 'Дикарев Альберт Вениаминович', 'date' => '22.03.2017'];
$users[] = ['name' => 'Долматов Алексей Леонидович', 'date' => '31.03.2017'];
$users[] = ['name' => 'Желтухин Михаил Владимирович', 'date' => '15.03.2017'];
$users[] = ['name' => 'Жиганов Александр Лаврентьевич', 'date' => '17.03.2017'];
$users[] = ['name' => 'Исаковский Иван Васильевич', 'date' => '20.03.2017'];
$users[] = ['name' => 'Калининский Евгений Валентинович', 'date' => '13.03.2017'];
$users[] = ['name' => 'Коновалова Анна Васильевна', 'date' => '01.06.2017'];
$users[] = ['name' => 'Креузова Валентина Петровна', 'date' => '09.03.2017'];
$users[] = ['name' => 'Кузнецов Александр Александрович', 'date' => '09.03.2017'];
$users[] = ['name' => 'Моисеев Денис Валерьевич', 'date' => '03.03.2017'];
$users[] = ['name' => 'Морозов Владимир Валерьевич', 'date' => '31.03.2017'];
$users[] = ['name' => 'Новиков Владимир Сергеевич', 'date' => '14.03.2017'];
$users[] = ['name' => 'Пантелеев Евгений Николаевич', 'date' => '13.03.2017'];
$users[] = ['name' => 'Поляков Дмитрий Владимирович', 'date' => '27.03.2017'];
$users[] = ['name' => 'Порохова Галина Валентиновна', 'date' => '15.03.2017'];
$users[] = ['name' => 'Пятакова Елена Михайловна', 'date' => '07.03.2017'];
$users[] = ['name' => 'Сивкова Татьяна Васильевна', 'date' => '14.03.2017'];
$users[] = ['name' => 'Сухарев Валерий Николаевич', 'date' => '09.03.2017'];
$users[] = ['name' => 'Тропин Николай Феодосьевич', 'date' => '06.03.2017'];
$users[] = ['name' => 'Тухов Лев Николаевич', 'date' => '09.03.2017'];
$users[] = ['name' => 'Уклеина Нелли Юрьевна', 'date' => '17.03.2017'];
$users[] = ['name' => 'Юзгина Ольга Альбертовна', 'date' => '28.02.2017'];

$users = collect($users)->map(function($value) {
    return ['name' => $value['name'], 'date' => \Carbon\Carbon::parse($value['date'])];
});

$requisites[]=['bik' => '041909644', 'name' => 'Шнуров Игорь Алексеевич', 'bankAccount' => '40817.810.1.12250534918', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Шилов Николай Александрович', 'bankAccount' => '40817.810.6.31604009251', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Хапов Юрий Валентинович', 'bankAccount' => '40817.810.0.12002397526', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Трунин Андрей Геннадьевич', 'bankAccount' => '40817.810.0.12001637973', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Субботин Сергей Александрович', 'bankAccount' => '40817.810.9.12001520465', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Сочнева Анна Алексеевна', 'bankAccount' => '40817.810.7.12001689962', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Смыслов Сергей Валентинович', 'bankAccount' => '40817.810.7.12002160927', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Смирнова Анна Евгеньевна', 'bankAccount' => '40817.810.1.12001200598', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Смирнов Юрий Александрович', 'bankAccount' => '40817.810.8.12002172608', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Слыхалов Александр Владимирович', 'bankAccount' => '40817.810.5.12001892920', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Сидоренков Иван Сергеевич', 'bankAccount' => '40817.810.7.12002398951', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Седов Николай Мартьянович', 'bankAccount' => '40817.810.3.12000021633', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Седов Евгений Николаевич', 'bankAccount' => '40817.810.6.12250558562', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Свечинова Любовь Андреевна', 'bankAccount' => '40817.810.1.12250560322', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Савченко Ирина Сергеевна', 'bankAccount' => '40817.810.5.12002022032', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Родионов Сергей Викторович', 'bankAccount' => '40817.810.0.12250559747', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Постников Вадим Валентинович', 'bankAccount' => '40817.810.7.12002399044', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Пелевина Татьяна Юрьевна', 'bankAccount' => '40817.810.5.12250550356', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Пантелеева Наталья Михайловна', 'bankAccount' => '40817.810.5.12002392746', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Паничев Геннадий Валерьевич', 'bankAccount' => '42307.810.4.12250534854', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Молотобойцев Денис Юрьевич', 'bankAccount' => '40817.810.9.31604014195', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '044030707', 'name' => 'Митин Сергей Вадимович', 'bankAccount' => '40817.810.8.31604009433', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Миронова Ирина Леонидовна', 'bankAccount' => '40817.810.0.12009641974', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Матюшин Александр Леонидович', 'bankAccount' => '40817.810.0.31604009505', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Маслова Валентина Юрьевна', 'bankAccount' => '40817.810.8.12009437197', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Малышев Александр Сергеевич', 'bankAccount' => '40817.810.5.31604009270', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Логинов Геннадий Валерианович', 'bankAccount' => '40817.810.2.12250558548', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Леонов Владимир Валерьевич', 'bankAccount' => '40817.810.9.31604009294', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '044030707', 'name' => 'Лапшин Леонид Анатольевич', 'bankAccount' => '40817.810.6.31604009662', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Круглов Николай Александрович', 'bankAccount' => '40817.810.3.12009687450', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Красильников Анатолий Николаевич', 'bankAccount' => '40817.810.4.31604009260', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '044030707', 'name' => 'Красильников Александр Николаевич', 'bankAccount' => '40817.810.9.31604009252', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Коновалова Алла Васильевна', 'bankAccount' => '40817.810.1.12009657622', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Киселев Василий Павлович', 'bankAccount' => '40817.810.3.12002591886', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Ершов Виктор Владимирович', 'bankAccount' => '40817.810.4.12250558539', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Залесский Дмитрий Анатольевич', 'bankAccount' => '40817.810.6.12002202998', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Егоров Валерий Вадимович', 'bankAccount' => '40817.810.2.12001567487', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Дягилев Юрий Николаевич', 'bankAccount' => '40817.810.4.12009625464', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Долгов Андрей Валерьевич', 'bankAccount' => '40817.810.3.31604009292', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Гаркуша Андрей Владимирович', 'bankAccount' => '40817.810.6.12250031050', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Волокитин Андрей Сергеевич', 'bankAccount' => '40817.810.7.12001905183', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Владычанская Анна Витальевна', 'bankAccount' => '40817.810.7.12002172410', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Веселкова Нина Николаевна', 'bankAccount' => '40817.810.9.12250451644', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Грошева Алена Николаевна', 'bankAccount' => '40817.810.5.12001555746', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Быков Андрей Анатольевич', 'bankAccount' => '40817.810.1.31604014885', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '044030707', 'name' => 'Бушманова Вера Геннадьевна', 'bankAccount' => '40817.810.5.31604009461', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '044030707', 'name' => 'Борисов Алексей Алексеевич', 'bankAccount' => '40817.810.3.31604009250', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Богданов Алексей Емельянович', 'bankAccount' => '40817.810.1.12002585759', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Щеглов Алексей Викторович', 'bankAccount' => '40817.810.5.31604009296', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Токарева Татьяна Александровна', 'bankAccount' => '40817.810.1.12001452113', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Соколов Николай Дмитриевич', 'bankAccount' => '40817.810.5.31604009432', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Миронова Наталья Валерьевна', 'bankAccount' => '40817.810.1.12002172434', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Калинин Алексей Валерьевич', 'bankAccount' => '40817.810.9.31604009498', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Борисов Сергей Николаевич', 'bankAccount' => '40817.810.0.12001471090', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Бодунов Артем Вячеславович', 'bankAccount' => '40817.810.1.12002224052', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Токарев Алексей Викторович', 'bankAccount' => '40817.810.2.12000037109', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Шилова Елена Олеговна', 'bankAccount' => '40817.810.2.12009441408', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Снятков Евгений Сергеевич', 'bankAccount' => '40817.810.1.31604009256', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '044030707', 'name' => 'Рогалев Максим Андреевич', 'bankAccount' => '40817.810.5.31604009267', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Будаев Андрей Игоревич', 'bankAccount' => '40817.810.8.12001632152', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Михеева Анна Николаевна', 'bankAccount' => '40817.810.9.12250668084', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Порохова Галина Валентиновна', 'bankAccount' => '40817.810.6.12250558559', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Попова Галина Михайловна', 'bankAccount' => '40817.810.7.31604009478', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Ершова Светлана Николаевна', 'bankAccount' => '40817.810.0.12001324341', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Бречалов Николай Алексеевич', 'bankAccount' => '40817.810.3.31604009496', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '044030707', 'name' => 'Белозеров Василий Сергеевич', 'bankAccount' => '40817.810.8.31604009297', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '044030707', 'name' => 'Белов Алексей Николаевич', 'bankAccount' => '40817.810.6.31604009439', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Исаковский Иван Васильевич', 'bankAccount' => '40817.810.1.12001207614', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Сивкова Татьяна Васильевна', 'bankAccount' => '40817.810.2.12001567652', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Кузнецов Александр Александрович', 'bankAccount' => '40817.810.7.12001862682', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Юзгина Ольга Альбертовна', 'bankAccount' => '40817.810.2.12001908700', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Бачурина Елена Александровна', 'bankAccount' => '40817.810.3.12002172409', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Пискунова Юлия Эдуардовна', 'bankAccount' => '40817.810.0.12002170332', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Борисов Алексей Владимирович', 'bankAccount' => '40817.810.0.31604009275', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Поляков Дмитрий Владимирович', 'bankAccount' => '40817.810.8.12250559235', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Сухарев Валерий Николаевич', 'bankAccount' => '40817.810.3.12002170184', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Бурдюг Денис Владимирович', 'bankAccount' => '40817810412001124510', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Буров Алексей Николаевич', 'bankAccount' => '40817810131604009502', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Дикарев Альберт Вениаминович', 'bankAccount' => '40817810112252880576', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Калининский Евгений Валентинович', 'bankAccount' => '40817810031604009262', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Морозов Владимир Валерьевич', 'bankAccount' => '40817810212250036099', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Новиков Владимир Сергеевич', 'bankAccount' => '40817810412250558555', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Пантелеев Евгений Николаевич', 'bankAccount' => '40817810212250559314', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Пятакова Елена Михайловна', 'bankAccount' => '40817810831604013050', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Тропин Николай Феодосьевич', 'bankAccount' => '40817810112250558567', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Тухов Лев Николаевич', 'bankAccount' => '40817810431604009477', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Лапшина Ирина Викторовна', 'bankAccount' => '40817810412001659603', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Моисеев Денис Валерьевич', 'bankAccount' => '40817810612001639850', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Долматов Алексей Леонидович', 'bankAccount' => '40817810112000035311', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Желтухин Михаил Владимирович', 'bankAccount' => '40817810512002395329', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Жиганов Александр Лаврентьевич', 'bankAccount' => '40817810931604009485', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30101.810.2.40300000707'];
$requisites[]=['bik' => '041909644', 'name' => 'Креузова Валентина Петровна', 'bankAccount' => '40817810812001203170', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Барышев Игорь Николаевич', 'bankAccount' => '40817810212250500677', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Уклеина Нелли Юрьевна', 'bankAccount' => '40817810712250558569', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];


$requisites = collect($requisites)->map(function($requisite) {
    return [
        'bik' => $requisite['bik'], 
        'user' => trim($requisite['name']), 
        'bankAccount' => str_replace('.', '', $requisite['bankAccount']), 
        'bank' => trim($requisite['bank']), 
        'inn' => $requisite['inn'],
        'loroAccount' => str_replace('.', '', $requisite['loroAccount']),
    ];
});

$payment_day = 15;
$payment_proc = 0.5;
$cbr_koef = 150;
$end_day = \Carbon\Carbon::parse('15.02.2021');
$from_day = \Carbon\Carbon::parse('06.10.2020');

$stavka[] = array('start' => \Carbon\Carbon::parse('14.06.2016'), 'end' => \Carbon\Carbon::parse('18.09.2016'), 'amount' => 10.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('19.09.2016'), 'end' => \Carbon\Carbon::parse('26.03.2017'), 'amount' => 10);
$stavka[] = array('start' => \Carbon\Carbon::parse('27.03.2017'), 'end' => \Carbon\Carbon::parse('01.05.2017'), 'amount' => 9.75);
$stavka[] = array('start' => \Carbon\Carbon::parse('02.05.2017'), 'end' => \Carbon\Carbon::parse('18.06.2017'), 'amount' => 9.25);
$stavka[] = array('start' => \Carbon\Carbon::parse('19.06.2017'), 'end' => \Carbon\Carbon::parse('17.09.2017'), 'amount' => 9);
$stavka[] = array('start' => \Carbon\Carbon::parse('18.09.2017'), 'end' => \Carbon\Carbon::parse('29.10.2017'), 'amount' => 8.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('30.10.2017'), 'end' => \Carbon\Carbon::parse('17.12.2017'), 'amount' => 8.25);
$stavka[] = array('start' => \Carbon\Carbon::parse('18.12.2017'), 'end' => \Carbon\Carbon::parse('11.02.2018'), 'amount' => 7.75);
$stavka[] = array('start' => \Carbon\Carbon::parse('12.02.2018'), 'end' => \Carbon\Carbon::parse('25.03.2018'), 'amount' => 7.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('26.03.2018'), 'end' => \Carbon\Carbon::parse('16.09.2018'), 'amount' => 7.25);
$stavka[] = array('start' => \Carbon\Carbon::parse('17.09.2018'), 'end' => \Carbon\Carbon::parse('16.12.2018'), 'amount' => 7.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('17.12.2018'), 'end' => \Carbon\Carbon::parse('16.06.2019'), 'amount' => 7.75);
$stavka[] = array('start' => \Carbon\Carbon::parse('17.06.2019'), 'end' => \Carbon\Carbon::parse('28.07.2019'), 'amount' => 7.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('29.07.2019'), 'end' => \Carbon\Carbon::parse('08.09.2019'), 'amount' => 7.25);
$stavka[] = array('start' => \Carbon\Carbon::parse('09.09.2019'), 'end' => \Carbon\Carbon::parse('27.10.2019'), 'amount' => 7);
$stavka[] = array('start' => \Carbon\Carbon::parse('28.10.2019'), 'end' => \Carbon\Carbon::parse('15.12.2019'), 'amount' => 6.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('16.12.2019'), 'end' => \Carbon\Carbon::parse('09.02.2020'), 'amount' => 6.25);
$stavka[] = array('start' => \Carbon\Carbon::parse('10.02.2020'), 'end' => \Carbon\Carbon::parse('26.04.2020'), 'amount' => 6);
$stavka[] = array('start' => \Carbon\Carbon::parse('27.04.2020'), 'end' => \Carbon\Carbon::parse('21.06.2020'), 'amount' => 5.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('22.06.2020'), 'end' => \Carbon\Carbon::parse('26.07.2020'), 'amount' => 4.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('27.07.2020'), 'end' => \Carbon\Carbon::now(), 'amount' => 4.25);
$stavka = collect($stavka);


$paymentPeriods = collect([
    ['text' => 'а апрель ', 'month' => '01.04.2017'],
    ['text' => 'а май ', 'month' => '01.05.2017'],
    ['text' => 'а июнь ', 'month' => '01.06.2017'],
    ['text' => 'а июль ', 'month' => '01.07.2017'],
    ['text' => 'а август ', 'month' => '01.08.2017'],
    ['text' => '(октябрь ', 'month' => '01.10.2017'],
    ['text' => '(ноябрь ', 'month' => '01.11.2017'],
    ['text' => '(декабрь ', 'month' => '01.12.2019'],
    ['text' => '(январь ', 'month' => '01.01.2020'],
])->map(function($value) {
    return ['text' => $value['text'], 'month' => \Carbon\Carbon::parse($value['month'])->endOfMonth()];
});


function getPayment(array $array) 
{
    if ($array['paid']) 
        return [
            'date' => \Carbon\Carbon::parse($array['date']),
            'amount' => (float) str_replace(',', '.', $array['paid']),
        ]; 
    else return [];
}

function getDismissalDate($users, $username)
{
    $key = $users->search(function($user) use ($username) {
        return $username == $user['name'];
    });
    if ($key === false) dd('Пользователь не найлен', $username);
    
    return $users[$key]['date'];
}

function getSalaryDate($paymentPeriods, $payment)
{
    return getFirstWorkedDay(\Carbon\Carbon::parse($payment['description'])->endOfMonth());
}

function is_holiday(\Carbon\Carbon $date)
{
	$holidays = array(
		'06.11.2016',
    '01.01.2017', '02.01.2017', '03.01.2017', '04.01.2017', '05.01.2017', '06.01.2017',
		'23.02.2017', '24.02.2017',
		'08.03.2017',
		'01.05.2017', '08.05.2017', '09.05.2017',
		'12.06.2017',
		'06.11.2017',
		'01.01.2018', '02.01.2018', '03.01.2018', '04.01.2018', '05.01.2018', '08.01.2018',
		'23.02.2018',
		'01.01.2018',
		'08.03.2018', '09.03.2018',
		'30.04.2018',
		'01.05.2018', '02.05.2018', '09.05.2018',
		'11.06.2018', '12.06.2018',
		'05.11.2018',
		'31.12.2018',
		'01.01.2019', '02.01.2019', '03.01.2019', '04.01.2019', '07.01.2019', '08.01.2019',
		'08.03.2019', 
		'01.05.2019', '02.05.2019', '03.05.2019', '09.05.2019', '10.05.2019', 
		'12.06.2019', 
		'04.11.2019', 
		'01.01.2020', '02.01.2020', '03.01.2020', '06.01.2020', '07.01.2020', '08.01.2020',
		'24.02.2020',
		'09.03.2020', 
		'01.05.2020', '04.05.2020', '05.05.2020', '11.05.2020', 
		'12.06.2020', 
		'04.11.2020', 
	);
	$works = [
    	'28.04.2018', '09.06.2018', '29.12.2018',
	];
	
	if ($date->dayOfWeekIso == 6 || $date->dayOfWeekIso == 7) {
    	if (in_array($date->format('d.m.Y'), $works)) return false;
    	else return true;
	}
	else {
    	if (in_array($date->format('d.m.Y'), $holidays)) return true;
    	else return false;
	}
}

function getFirstWorkedDay(\Carbon\Carbon $date)
{
    $date = \Carbon\Carbon::parse($date->format('d.m.Y'));
    while(is_holiday($date)) {
        $date->subDay();
    }
    
    return $date;
}

function getBalance($periods, \Carbon\Carbon $date) 
{
    return collect($periods)->sortBy('date')->filter(function($period) use ($date) {
        return $period['date'] <= $date;
    })->last()['balance'];
    
}


// Собираем платежи
$payments = [];
foreach ($array as $element) {
    // коррекция алиментов
    if ($element['user'] == 'Ершова Светлана Николаевна') $element['user'] = 'Ершов Виктор Владимирович';
    $element['user'] = trim($element['user']);
    
    if ($element['amount'] != '') {
        $payments[] = [
            'amount' => (float) str_replace(',', '.', $element['amount']),
            'description' => $element['description'],
            'user' => $element['user'],
            'payments' => [getPayment($element)],
        ];
    } else $payments[count($payments) - 1]['payments'][] = getPayment($element);
}

// фильтруем платежи
$payments = collect($payments);
$payments = $payments->filter(function($value, $key){
    return ! (strpos($value['user'], 'ИФНС') !== false || strpos($value['description'], ' задержку ') !== false);
});


// проверка невозможности идентификации платежа по имени
foreach ($payments as $payment) {
    if ($users->search(function ($item, $key) use ($payment) {
        return $item['name'] == $payment['user'];
    }) === false) dd($payment);
}

$payments = $payments->all();


// определяем срок оплаты
foreach ($payments as $key => $payment) {
    $periods = [];
    /*
    $firstPartSalary = getSalaryDate($paymentPeriods, $payment);
    $payments[$key]['salaryDate'] = $firstPartSalary;
    
    $secondPartSalary = getFirstWorkedDay(\Carbon\Carbon::parse($firstPartSalary->format('d.m.Y'))->startOfMonth()->addMonth()->addDays($payment_day - 1));
    $firstPartSalary = getFirstWorkedDay($firstPartSalary);
    
    $dismissal = getDismissalDate($users, $payment['user']);
    $payments[$key]['dismissalDate'] = $dismissal;
    
    $dismissalMonth = \Carbon\Carbon::parse($dismissal->format('d.m.Y'))->startOfMonth();
    $salaryMonth = \Carbon\Carbon::parse(getSalaryDate($paymentPeriods, $payment)->format('d.m.Y'))->startOfMonth();
    

    if ($salaryMonth == $dismissalMonth) {
        if ($firstPartSalary >= $dismissal) {
            $periods[] = ['date' => $dismissal, 'balance' => $payment['amount']];
        } else {
            $periods[] = ['date' => $firstPartSalary, 'balance' => round(($payment['amount'] * $payment_proc), 2)];
            $periods[] = ['date' => $dismissal, 'balance' => $payment['amount']];
        }
    } elseif ($salaryMonth > $dismissalMonth) {
        $periods[] = ['date' => $firstPartSalary, 'balance' => $payment['amount']];
    } else {
        if ($dismissal >= $secondPartSalary) {
            $periods[] = ['date' => $firstPartSalary, 'balance' => round(($payment['amount'] * $payment_proc), 2)];
            $periods[] = ['date' => $secondPartSalary, 'balance' => $payment['amount']];
        } else {
            $periods[] = ['date' => $firstPartSalary, 'balance' => round(($payment['amount'] * $payment_proc), 2)];
            $periods[] = ['date' => $dismissal, 'balance' => $payment['amount']];
        }
    }
    */
    
    $salary = getFirstWorkedDay(getSalaryDate($paymentPeriods, $payment)->startOfMonth()->addMonth()->addDays($payment_day - 1));

    $payments[$key]['salaryDate'] = $salary;
    
    $dismissal = getDismissalDate($users, $payment['user']);
    $payments[$key]['dismissalDate'] = $dismissal;
    
    $dismissalMonth = \Carbon\Carbon::parse($dismissal->format('d.m.Y'))->startOfMonth();
    $salaryMonth = \Carbon\Carbon::parse(getSalaryDate($paymentPeriods, $payment)->format('d.m.Y'))->startOfMonth();

    if ($salaryMonth == $dismissalMonth) {
        $periods[] = ['date' => $dismissal, 'balance' => $payment['amount']];
    } elseif ($salaryMonth > $dismissalMonth) {
        $periods[] = ['date' => $salary, 'balance' => $payment['amount']];
    } else {
        if ($dismissal >= $salary) {
            $periods[] = ['date' => $salary, 'balance' => $payment['amount']];
        } else {
            $periods[] = ['date' => $dismissal, 'balance' => $payment['amount']];
        }
    }

    // получаем оплаты и расчитываем баланс
    $paids = collect($payment['payments'])->sortBy('date')->all();
    foreach ($paids as $paid) {
        if ($paid) $periods[] = ['date' => \Carbon\Carbon::parse($paid['date']->format('d.m.Y'))->addDay(), 'balance' => round((getBalance($periods, $paid['date']) - $paid['amount']), 2)];
    }
    
    $periods[] = ['date' => $from_day, 'balance' => getBalance($periods, $from_day)];
    
    
    // добавиляем периоды по ставке рефинансирования
    
    $banks = $stavka->filter(function($item) use ($periods, $end_day) {
        return $item['start'] >= $periods[0]['date'];
    });
    
    foreach ($banks as $bank) {
        $balance = getBalance($periods, $bank['start']);
        $periods[] = ['date' => $bank['start'], 'balance' => $balance];
        if ($balance == 0.01) break;
    }
    
    $periods = collect($periods)->sortBy('date')->unique();
    
    // сброс ключей
    $newPeriods = [];
    foreach ($periods as $period) {
        $newPeriods[] = $period;
    }
    $periods = $newPeriods;
    
    $payments[$key]['periods'] = $periods;
    
    
    // делаем расчет процентов
    $procs = [];
    for ($i = 0; $i < count($periods); $i++) {
        $period = $periods[$i];
        if ($period['date'] >= $from_day && $period['balance'] >= 0.01) {
            $proc = $stavka->filter(function($item) use ($period) {
                return $period['date'] >= $item['start'] && $item['end'] >= $period['date'];
            })->first()['amount'];
            
            $next = $periods[$i + 1] ?? [];
            $currentDay = $period['date'];
            $nextDay = $next ? \Carbon\Carbon::parse($next['date']->format('d.m.Y'))->subDay() : $end_day;
            
            $days = $nextDay->diffInDays($currentDay) + 1;
            
            $procs[] = [
                'start' => $currentDay->format('d.m.Y'),
                'end' => $nextDay->format('d.m.Y'),
                'days' => $days,
                'proc' => $proc,
                'amount' => round(($days * $period['balance'] * $proc / 100 / $cbr_koef), 2),
                'balance' => $period['balance'],
            ];
        }
    }
    
    $payments[$key]['procs'] = $procs;
}
    
$calculation = collect($payments)->groupBy('user');

// генерация файла 1с

$nomer = 235;
$date = \Carbon\Carbon::now()->format('d.m.Y');

$output = '1CClientBankExchange' . PHP_EOL;
$output .= 'ВерсияФормата=1.02' . PHP_EOL;
$output .= 'Кодировка=Windows' . PHP_EOL;
$output .= 'Отправитель=Бухгалтерия предприятия, редакция 2.0' . PHP_EOL;
$output .= 'Получатель=Система Клиент-Банк "BClient"' . PHP_EOL;
$output .= 'ДатаСоздания=' . $date . PHP_EOL;
$output .= 'ВремяСоздания=10:48:37' . PHP_EOL;
$output .= 'ДатаНачала=' . $date . PHP_EOL;
$output .= 'ДатаКонца=' . $date . PHP_EOL;
$output .= 'РасчСчет=40702810212000011573' . PHP_EOL;
$output .= 'Документ=Платежное поручение' . PHP_EOL;

foreach ($calculation as $user => $payments) {
    $amount = 0;
    foreach ($payments as $payment) {
        foreach($payment['procs'] as $proc) {
            $amount += $proc['amount'];
        }
    }
    
    $key = $requisites->search(function($item) use ($user) {
        return $user == $item['user'];
    });
    
    if ($key === false) dump('Реквизиты не найдены: ' . $user);
    $requisite = $requisites[$key];
    //if ($requisite['user'] == 'Седов Николай Мартьянович' || $requisite['user'] == 'Седов Евгений Николаевич') continue;
    
    $output .= 'СекцияДокумент=Платежное поручение' . PHP_EOL;
	$output .= 'Номер=' . $nomer . PHP_EOL;
	$output .= 'Дата=' . $date . PHP_EOL;
	$output .= 'Сумма='. $amount . PHP_EOL;
	$output .= 'ПлательщикСчет=40702810212000011573' . PHP_EOL;
	$output .= 'Плательщик=ИНН 3525083563 ООО Стройпластик' . PHP_EOL;
	$output .= 'ПлательщикИНН=3525083563' . PHP_EOL;
	$output .= 'Плательщик1=ООО Стройпластик' . PHP_EOL;
	$output .= 'ПлательщикРасчСчет=40702810212000011573' . PHP_EOL;
	$output .= 'ПлательщикБанк1=ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК' . PHP_EOL;
	$output .= 'ПлательщикБанк2=Г. Вологда' . PHP_EOL;
	$output .= 'ПлательщикБИК=041909644' . PHP_EOL;
	$output .= 'ПлательщикКорсчет=30101810900000000644' . PHP_EOL;
	$output .= 'ПолучательСчет=' . $requisite['bankAccount'] . PHP_EOL;
	$output .= 'Получатель=ИНН ' . $requisite['inn'] . ' ' . $requisite['user'] . PHP_EOL;
	$output .= 'ПолучательИНН=' . $requisite['inn'] . PHP_EOL;
	$output .= 'Получатель1=' . $requisite['user'] . PHP_EOL;
	$output .= 'ПолучательРасчСчет=' . $requisite['bankAccount'] . PHP_EOL;
	$output .= 'ПолучательБанк1=' . $requisite['bank'] . PHP_EOL;
	$output .= 'ПолучательБанк2=' . ($requisite['bik'] == '044030707' ? '' : 'Г. Вологда') . PHP_EOL;
	$output .= 'ПолучательБИК=' . $requisite['bik'] . PHP_EOL;
	$output .= 'ВидПлатежа=Электронно' . PHP_EOL;
	$output .= 'ВидОплаты=01' . PHP_EOL;
	$output .= 'СтатусСоставителя=' . PHP_EOL;
	$output .= 'ПлательщикКПП=352501001' . PHP_EOL;
	$output .= 'ПолучательКПП=' . PHP_EOL;
	$output .= 'ПоказательКБК=' . PHP_EOL;
	$output .= 'ОКАТО=' . PHP_EOL;
	$output .= 'ПоказательОснования=' . PHP_EOL;
	$output .= 'ПоказательПериода=' . PHP_EOL;
	$output .= 'ПоказательНомера=' . PHP_EOL;
	$output .= 'ПоказательДаты=' . PHP_EOL;
	$output .= 'ПоказательТипа=' . PHP_EOL;
	$output .= 'Очередность=2' . PHP_EOL;
	$output .= 'НазначениеПлатежа=Компенсация за задержку заработной платы за апрель 2017 года - июль 2020 года. НДС не облагается' . PHP_EOL;
	$output .= 'НазначениеПлатежа1=Компенсация за задержку заработной платы за апрель 2017 года - июль 2020 года. НДС не облагается' . PHP_EOL;
	$output .= 'Код=' . PHP_EOL;
	$output .= 'КонецДокумента' . PHP_EOL;
	
	$nomer++;
}

$output .= 'КонецФайла';

Storage::disk('reportsStorage')->put('1c_document.txt', iconv('UTF-8', 'WINDOWS-1251', $output));

$itog = 0;
@endphp
<table border="1" style="border-collapse:collapse">
@foreach($calculation as $user => $payments)
    @php
        $balanceItog = 0;
    @endphp
    <tr>
        <td>{{ $user }}</td>
        <td>{{ $payments[0]['dismissalDate']->format('d.m.Y') }}</td>
        <td>
            <table border="1" style="border-collapse:collapse" width="100%">
                @foreach ($payments as $payment)
                    <tr>
                    @php
                        $balance = 0;
                    @endphp
                        <td width="30%">{{ $payment['description'] }}</td>
                        <td>{{ number_format($payment['amount'], 2, ',', ' ') }} руб.</td>
                        <td>
                            <table border="1" style="border-collapse:collapse"  width="100%">
                            @foreach($payment['payments'] as $paid)
                                @if(! empty($paid))
                                <tr>
                                    <td>{{ $paid['date']->format('d.m.Y') }}</td>
                                    <td>{{ number_format($paid['amount'], 2, ',', ' ') }} руб.</td>
                                </tr>
                                @endif
                            @endforeach
                            </table>
                        </td>
                        <td>
                            <table border="1" style="border-collapse:collapse"  width="100%">
                                @foreach($payment['procs'] as $proc)
                                    @if($proc['balance'] >= 0.01)
                                        @php
                                            $balance += $proc['amount'];
                                        @endphp
                                        <tr>
                                            <td>{{ $proc['start'] }} - {{ $proc['end'] }}</td>
                                            <td>{{ $proc['days'] }}</td>
                                            <td>{{ $proc['proc'] }}%</td>
                                            <td>{{ number_format($proc['balance'], 2, ',', ' ') }} руб.</td>
                                            <td>{{ number_format($proc['amount'], 2, ',', ' ') }} руб.</td>
                                        </tr>
                                    @endif
                                @endforeach
                                <tr>
                                    <td colspan="4">Итого</td>
                                    <td>{{ number_format($balance, 2, ',', ' ') }} руб.</td>
                                </tr>
                                @php
                                    $balanceItog += $balance;
                                @endphp
                            </table>
                        </td>
                    </tr>
                @endforeach
            </table>
        </td>
        <td>{{ number_format($balanceItog, 2, ',', ' ') }} руб.</td>
    </tr>
    @php
        $itog += $balanceItog;
    @endphp
@endforeach
</table>
<p>Всего - {{ number_format($itog, 2, ',', ' ') }} руб.</p>
<table border="1" style="border-collapse:collapse">
@foreach($calculation as $user => $payments)
    <tr>
        <td>{{ $user }}</td>
        @php
          $balance = 0;
          $balanceProc = 0;
          foreach ($payments as $payment) {
            $balance += $payment['amount'];
            foreach($payment['procs'] as $proc) {
              $balanceProc += $proc['amount'];
            }
          }
        @endphp
        <td>{{ number_format($balance, 2, ',', '') }}</td>
        <td>{{ number_format($balanceProc, 2, ',', '') }}</td>
    </tr>
@endforeach
</table>