@php
$array[] = array('amount' => '27105,88', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. НДС не облагается.', 'user' => 'Белов Алексей Николаевич', 'date' => '10.07.2017', 'paid' => '1487,58');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '17.07.2017', 'paid' => '25618,3');
$array[] = array('amount' => '214076,78', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. НДС не облагается.', 'user' => 'Белозеров Василий Сергеевич', 'date' => '17.07.2017', 'paid' => '174381,7');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '20.07.2017', 'paid' => '30000');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '30.08.2017', 'paid' => '9695,08');
$array[] = array('amount' => '11285', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. НДС не облагается.', 'user' => 'Богданов Алексей Емельянович', 'date' => '30.08.2017', 'paid' => '11285');
$array[] = array('amount' => '80040', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. НДС не облагается', 'user' => 'Бодунов Артем Вячеславович', 'date' => '30.08.2017', 'paid' => '46760,92');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '07.09.2017', 'paid' => '33279,08');
$array[] = array('amount' => '25096,52', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. НДС не облагается.', 'user' => 'Борисов Алексей Алексеевич', 'date' => '07.09.2017', 'paid' => '5120,92');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '12.09.2017', 'paid' => '19975,6');
$array[] = array('amount' => '25130,51', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. НДС не облагается.', 'user' => 'Борисов Сергей Николаевич', 'date' => '12.09.2017', 'paid' => '25130,51');
$array[] = array('amount' => '3891,15', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. НДС не облагается.', 'user' => 'Бречалов Николай Алексеевич', 'date' => '12.09.2017', 'paid' => '3891,15');
$array[] = array('amount' => '13130,75', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. НДС не облагается.', 'user' => 'Будаев Андрей Игоревич', 'date' => '12.09.2017', 'paid' => '13130,75');
$array[] = array('amount' => '9746,63', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. НДС не облагается.', 'user' => 'Бушманова Вера Геннадьевна', 'date' => '12.09.2017', 'paid' => '9746,63');
$array[] = array('amount' => '11884,16', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. НДС не облагается.', 'user' => 'Быков Андрей Анатольевич', 'date' => '12.09.2017', 'paid' => '11884,16');
$array[] = array('amount' => '11519,51', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. Сумма 11519-51 Без налога (НДС)', 'user' => 'Веселкова Нина Николаевна', 'date' => '12.09.2017', 'paid' => '11519,51');
$array[] = array('amount' => '15008', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. Сумма 15008-00 Без налога (НДС)', 'user' => 'Владычанская Анна Витальевна', 'date' => '12.09.2017', 'paid' => '4721,69');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '18.09.2017', 'paid' => '10286,31');
$array[] = array('amount' => '22458,28', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. Сумма 22458-28 Без налога (НДС)', 'user' => 'Волокитин Андрей Сергеевич', 'date' => '18.09.2017', 'paid' => '22458,28');
$array[] = array('amount' => '3002', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. Сумма 3002-00 Без налога (НДС)', 'user' => 'Гаркуша Андрей Владимирович', 'date' => '18.09.2017', 'paid' => '3002');
$array[] = array('amount' => '23972,84', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. Сумма 23972-84 Без налога (НДС)', 'user' => 'Долгов Андрей Валерьевич', 'date' => '18.09.2017', 'paid' => '23972,84');
$array[] = array('amount' => '13221,4', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. Сумма 13221-40 Без налога (НДС)', 'user' => 'Дягилев Юрий Николаевич', 'date' => '18.09.2017', 'paid' => '13221,4');
$array[] = array('amount' => '12326', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. Сумма 12326-00 Без налога (НДС)', 'user' => 'Егоров Валерий Вадимович', 'date' => '18.09.2017', 'paid' => '12326');
$array[] = array('amount' => '8066,8', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. Сумма 8066-80 Без налога (НДС)', 'user' => 'Ершов Виктор Владимирович', 'date' => '18.09.2017', 'paid' => '8066,8');
$array[] = array('amount' => '12326', 'description' => '{VO70060} Текущий платёж перечисление заработной платы за апрель 2017 год. Сумма 12326-00 Без налога (НДС)', 'user' => 'Залесский Дмитрий Анатольевич', 'date' => '18.09.2017', 'paid' => '6666,37');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '11.10.2017', 'paid' => '5659,63');
$array[] = array('amount' => '3973,2', 'description' => 'Текущий платёж перечисление перечисление алиментов в размере 33% заработка (Ершов Виктор Владимирович ) на основании исполн.док-та за апрель 2017 год. Сумма 3973-20 Без налога (НДС)', 'user' => 'Ершова Светлана Николаевна', 'date' => '20.11.2017', 'paid' => '3973,2');
$array[] = array('amount' => '12639,64', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. Сумма 12639-64 Без налога (НДС)', 'user' => 'Калинин Алексей Валерьевич', 'date' => '20.11.2017', 'paid' => '12639,64');
$array[] = array('amount' => '13403,4', 'description' => 'Текущий платёж перечисление заработной платы за апрель 2017 год. Сумма 13403-40 Без налога (НДС)', 'user' => 'Киселев Василий Павлович', 'date' => '20.11.2017', 'paid' => '1787,16');
$array[] = array('amount' => '17099,8', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 17099-80 Без налога (НДС)', 'user' => 'Коновалова Алла Васильевна', 'date' => '04.12.2017', 'paid' => '17099,8');
$array[] = array('amount' => '20147,33', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 20147-33 Без налога (НДС)', 'user' => 'Красильников Александр Николаевич', 'date' => '04.12.2017', 'paid' => '20147,33');
$array[] = array('amount' => '12629,69', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 12629-69 Без налога (НДС)', 'user' => 'Красильников Анатолий Николаевич', 'date' => '04.12.2017', 'paid' => '12629,69');
$array[] = array('amount' => '27078,88', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 27078-88 Без налога (НДС)', 'user' => 'Круглов Николай Александрович', 'date' => '04.12.2017', 'paid' => '6906,94');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '05.12.2017', 'paid' => '20171,94');
$array[] = array('amount' => '13126', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 13126-00 Без налога (НДС)', 'user' => 'Лапшин Леонид Анатольевич', 'date' => '05.12.2017', 'paid' => '13126');
$array[] = array('amount' => '10661,4', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 10661-40 Без налога (НДС)', 'user' => 'Леонов Владимир Валерьевич', 'date' => '05.12.2017', 'paid' => '10661,4');
$array[] = array('amount' => '12140,4', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 12140-40 Без налога (НДС)', 'user' => 'Логинов Геннадий Валерианович', 'date' => '05.12.2017', 'paid' => '12140,4');
$array[] = array('amount' => '10245', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 10245-00 Без налога (НДС)', 'user' => 'Малышев Александр Сергеевич', 'date' => '05.12.2017', 'paid' => '10245');
$array[] = array('amount' => '16008', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 16008-00 Без налога (НДС)', 'user' => 'Маслова Валентина Юрьевна', 'date' => '05.12.2017', 'paid' => '16008');
$array[] = array('amount' => '27293,26', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 27293-26 Без налога (НДС)', 'user' => 'Матюшин Александр Леонидович', 'date' => '05.12.2017', 'paid' => '27293,26');
$array[] = array('amount' => '9364', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 9364-00 Без налога (НДС)', 'user' => 'Миронова Ирина Леонидовна', 'date' => '05.12.2017', 'paid' => '9364');
$array[] = array('amount' => '11923,57', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 11923-57 Без налога (НДС)', 'user' => 'Миронова Наталья Валерьевна', 'date' => '05.12.2017', 'paid' => '11923,57');
$array[] = array('amount' => '25885,8', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 25885-80 Без налога (НДС)', 'user' => 'Митин Сергей Вадимович', 'date' => '05.12.2017', 'paid' => '25885,8');
$array[] = array('amount' => '35726,38', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 35726-38 Без налога (НДС)', 'user' => 'Михеева Анна Николаевна', 'date' => '05.12.2017', 'paid' => '35726,38');
$array[] = array('amount' => '23412', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 23412-00 Без налога (НДС)', 'user' => 'Молотобойцев Денис Юрьевич', 'date' => '05.12.2017', 'paid' => '23412');
$array[] = array('amount' => '11364,53', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 11364-53 Без налога (НДС)', 'user' => 'Паничев Геннадий Валерьевич', 'date' => '05.12.2017', 'paid' => '11364,53');
$array[] = array('amount' => '3001', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 3001-00 Без налога (НДС)', 'user' => 'Пантелеева Наталья Михайловна', 'date' => '05.12.2017', 'paid' => '3001');
$array[] = array('amount' => '3001', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 3001-00 Без налога (НДС)', 'user' => 'Пелевина Татьяна Юрьевна', 'date' => '05.12.2017', 'paid' => '3001');
$array[] = array('amount' => '141897,36', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 141897-36 Без налога (НДС)', 'user' => 'Попова Галина Михайловна', 'date' => '05.12.2017', 'paid' => '120038,74');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '07.12.2017', 'paid' => '21858,62');
$array[] = array('amount' => '4620,89', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 4620-89 Без налога (НДС)', 'user' => 'Порохова Галина Валентиновна', 'date' => '07.12.2017', 'paid' => '4620,89');
$array[] = array('amount' => '14436,27', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 14436-27 Без налога (НДС)', 'user' => 'Постников Вадим Валентинович', 'date' => '07.12.2017', 'paid' => '14436,27');
$array[] = array('amount' => '11364,53', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 11364-53 Без налога (НДС)', 'user' => 'Рогалев Максим Андреевич', 'date' => '07.12.2017', 'paid' => '1584,22');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '12.12.2017', 'paid' => '9780,31');
$array[] = array('amount' => '13203,7', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 13203-70 Без налога (НДС)', 'user' => 'Родионов Сергей Викторович', 'date' => '12.12.2017', 'paid' => '13203,7');
$array[] = array('amount' => '13694,82', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 13694-82 Без налога (НДС)', 'user' => 'Савченко Ирина Сергеевна', 'date' => '12.12.2017', 'paid' => '13694,82');
$array[] = array('amount' => '70035', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 70035-00 Без налога (НДС)', 'user' => 'Седов Николай Мартьянович', 'date' => '12.12.2017', 'paid' => '70035');
$array[] = array('amount' => '12910,09', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 12910-09 Без налога (НДС)', 'user' => 'Сидоренков Иван Сергеевич', 'date' => '12.12.2017', 'paid' => '12910,09');
$array[] = array('amount' => '16252,5', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 16252-50 Без налога (НДС)', 'user' => 'Смирнов Юрий Александрович', 'date' => '12.12.2017', 'paid' => '16252,5');
$array[] = array('amount' => '19637,24', 'description' => 'Текущий платёж перечисление вторая очередь заработной платы за апрель 2017 год. Сумма 19637-24 Без налога (НДС)', 'user' => 'Смирнова Анна Евгеньевна', 'date' => '12.12.2017', 'paid' => '19637,24');
$array[] = array('amount' => '21286,34', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 21286-34 Без налога (НДС)', 'user' => 'Смыслов Сергей Валентинович', 'date' => '12.12.2017', 'paid' => '21286,34');
$array[] = array('amount' => '15000', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 15000-00 Без налога (НДС)', 'user' => 'Снятков Евгений Сергеевич', 'date' => '12.12.2017', 'paid' => '15000');
$array[] = array('amount' => '13126', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 13126-00 Без налога (НДС)', 'user' => 'Соколов Николай Дмитриевич', 'date' => '12.12.2017', 'paid' => '13126');
$array[] = array('amount' => '15508', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 15508-00 Без налога (НДС)', 'user' => 'Сочнева Анна Алексеевна', 'date' => '12.12.2017', 'paid' => '15508');
$array[] = array('amount' => '5977,68', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 5977-68 Без налога (НДС)', 'user' => 'Субботин Сергей Александрович', 'date' => '12.12.2017', 'paid' => '5977,68');
$array[] = array('amount' => '11741,4', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 11741-40 Без налога (НДС)', 'user' => 'Токарев Алексей Викторович', 'date' => '12.12.2017', 'paid' => '11741,4');
$array[] = array('amount' => '10226,29', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 10226-29 Без налога (НДС)', 'user' => 'Токарева Татьяна Александровна', 'date' => '12.12.2017', 'paid' => '2663,92');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '18.12.2017', 'paid' => '7562,37');
$array[] = array('amount' => '29812,75', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 29812-75 Без налога (НДС)', 'user' => 'Трунин Андрей Геннадьевич', 'date' => '18.12.2017', 'paid' => '29812,75');
$array[] = array('amount' => '9741,4', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 9741-40 Без налога (НДС)', 'user' => 'Хапов Юрий Валентинович', 'date' => '18.12.2017', 'paid' => '9741,4');
$array[] = array('amount' => '13007', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 13007-00 Без налога (НДС)', 'user' => 'Шилова Елена Олеговна', 'date' => '18.12.2017', 'paid' => '13007');
$array[] = array('amount' => '13221,4', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 13221-40 Без налога (НДС)', 'user' => 'Шнуров Игорь Алексеевич', 'date' => '18.12.2017', 'paid' => '13221,4');
$array[] = array('amount' => '50207', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 50207-00 Без налога (НДС)', 'user' => 'Седов Евгений Николаевич', 'date' => '18.12.2017', 'paid' => '50207');
$array[] = array('amount' => '29794,08', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 29794-08 Без налога (НДС)', 'user' => 'Свечинова Любовь Андреевна', 'date' => '18.12.2017', 'paid' => '29794,08');
$array[] = array('amount' => '3002', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 3002-00 Без налога (НДС)', 'user' => 'Слыхалов Александр Владимирович', 'date' => '18.12.2017', 'paid' => '3002');
$array[] = array('amount' => '21875,88', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за апрель 2017 год. Сумма 21875-88 Без налога (НДС)', 'user' => 'Шилов Николай Александрович', 'date' => '18.12.2017', 'paid' => '21875,88');
$array[] = array('amount' => '4598,14', 'description' => 'Текущий платёж вторая очередь перечисление отпускных выплат за апрель 2017 год. Сумма 4598-14 Без налога (НДС)', 'user' => 'Савченко Ирина Сергеевна', 'date' => '18.12.2017', 'paid' => '4598,14');
$array[] = array('amount' => '12102,96', 'description' => 'Текущий платёж вторая очередь перечисление отпускных выплат за апрель 2017 год. Сумма 12102-96 Без налога (НДС)', 'user' => 'Токарев Алексей Викторович', 'date' => '18.12.2017', 'paid' => '12102,96');
$array[] = array('amount' => '7922,3', 'description' => 'Текущий платёж вторая очередь перечисление отпускных выплат за апрель 2017 год. Сумма 7922-30 Без налога (НДС)', 'user' => 'Токарева Татьяна Александровна', 'date' => '18.12.2017', 'paid' => '5075,02');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '20.12.2017', 'paid' => '2847,28');
$array[] = array('amount' => '4142,08', 'description' => 'Текущий платёж вторая очередь перечисление отпускных выплат за апрель 2017 год. Сумма 4142-08 Без налога (НДС)', 'user' => 'Михеева Анна Николаевна', 'date' => '20.12.2017', 'paid' => '4142,08');
$array[] = array('amount' => '5760,23', 'description' => 'Текущий платёж вторая очередь перечисление отпускных выплат за апрель 2017 год. Сумма 5760-23 Без налога (НДС)', 'user' => 'Круглов Николай Александрович', 'date' => '20.12.2017', 'paid' => '4918,74');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '20.12.2017', 'paid' => '841,49');
$array[] = array('amount' => '5520,14', 'description' => 'Текущий платёж вторая очередь перечисление компенсации за неиспользованный отпуск, заработной платы за апрель 2017 год. Сумма 5520-14 Без налога (НДС)', 'user' => 'Михеева Анна Николаевна', 'date' => '20.12.2017', 'paid' => '5520,14');
$array[] = array('amount' => '11953,32', 'description' => 'Текущий платёж вторая очередь перечисление отпускных выплат за апрель 2017 год. Сумма 11953-32 Без налога (НДС)', 'user' => 'Родионов Сергей Викторович', 'date' => '20.12.2017', 'paid' => '1085,47');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '22.12.2017', 'paid' => '6000');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '25.12.2017', 'paid' => '4867,85');
$array[] = array('amount' => '4922,73', 'description' => 'Текущий платёж вторая очередь перечисление отпускных выплат за апрель 2017 год. Сумма 4922-73 Без налога (НДС)', 'user' => 'Лапшин Леонид Анатольевич', 'date' => '25.12.2017', 'paid' => '4922,73');
$array[] = array('amount' => '15010,18', 'description' => 'Текущий платёж вторая очередь перечисление отпускных выплат за апрель 2017 год. Сумма 15010-18 Без налога (НДС)', 'user' => 'Смыслов Сергей Валентинович', 'date' => '25.12.2017', 'paid' => '15010,18');
$array[] = array('amount' => '8551,61', 'description' => 'Текущий платёж вторая очередь перечисление отпускных выплат за апрель 2017 год. Сумма 8551-61 Без налога (НДС)', 'user' => 'Шилов Николай Александрович', 'date' => '25.12.2017', 'paid' => '8551,61');
$array[] = array('amount' => '32887,1', 'description' => 'Текущий платёж вторая очередь перечисление компенсации за неиспользованный отпуск, заработной платы за апрель 2017 год. Сумма 32887-10 Без налога (НДС)', 'user' => 'Будаев Андрей Игоревич', 'date' => '25.12.2017', 'paid' => '32887,1');
$array[] = array('amount' => '4001', 'description' => 'Текущий платёж вторая очередь перечисление отпускных выплат за апрель 2017 год. Сумма 4001-00 Без налога (НДС)', 'user' => 'Шилова Елена Олеговна', 'date' => '25.12.2017', 'paid' => '4001');
$array[] = array('amount' => '4782,12', 'description' => 'Текущий платёж перечисление вторая очередь отпускных выплат за апрель 2017 год. Сумма 4782-12 Без налога (НДС)', 'user' => 'Смирнова Анна Евгеньевна', 'date' => '25.12.2017', 'paid' => '4782,12');
$array[] = array('amount' => '7614,4', 'description' => 'Текущий платёж перечисление отпускных выплат за апрель 2017 год. Сумма 7614-40 Без налога (НДС)', 'user' => 'Киселев Василий Павлович', 'date' => '25.12.2017', 'paid' => '7614,4');
$array[] = array('amount' => '20058,32', 'description' => 'Текущий платёж вторая очередь перечисление компенсации за неиспользованный отпуск, заработной платы за апрель 2017 год. Сумма 20058-32 Без налога (НДС)', 'user' => 'Рогалев Максим Андреевич', 'date' => '25.12.2017', 'paid' => '20058,32');
$array[] = array('amount' => '1412,58', 'description' => 'Текущий платёж вторая очередь перечисление отпускных выплат за апрель 2017 год. Сумма 1412-58 Без налога (НДС)', 'user' => 'Пелевина Татьяна Юрьевна', 'date' => '25.12.2017', 'paid' => '1412,58');
$array[] = array('amount' => '28344,88', 'description' => 'Текущий платёж вторая очередь перечисление компенсации неиспользованного отпуска, заработной платы за апрель 2017 год. Сумма 28344-88 Без налога (НДС)', 'user' => 'Снятков Евгений Сергеевич', 'date' => '25.12.2017', 'paid' => '28344,88');
$array[] = array('amount' => '19363', 'description' => 'Текущий платёж вторая очередь перечисление компенсации за неиспользованный отпуск, заработной платы за апрель 2017 год. Сумма 19363-00 Без налога (НДС)', 'user' => 'Шилова Елена Олеговна', 'date' => '25.12.2017', 'paid' => '19363');
$array[] = array('amount' => '14408,78', 'description' => 'Текущий платёж вторая очередь перечисление компенсации за неиспользованный отпуск, заработной платы за апрель 2017 год. Сумма 14408-78 Без налога (НДС)', 'user' => 'Токарев Алексей Викторович', 'date' => '25.12.2017', 'paid' => '14408,78');
$array[] = array('amount' => '18726,31', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 18726-31 Без налога (НДС)', 'user' => 'Богданов Алексей Емельянович', 'date' => '25.12.2017', 'paid' => '18726,31');
$array[] = array('amount' => '80040', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 80040-00 Без налога (НДС)', 'user' => 'Бодунов Артем Вячеславович', 'date' => '25.12.2017', 'paid' => '80040');
$array[] = array('amount' => '12614,64', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 12614-64 Без налога (НДС)', 'user' => 'Борисов Алексей Алексеевич', 'date' => '25.12.2017', 'paid' => '12614,64');
$array[] = array('amount' => '7450,4', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 7450-40 Без налога (НДС)', 'user' => 'Борисов Сергей Николаевич', 'date' => '25.12.2017', 'paid' => '7450,4');
$array[] = array('amount' => '7057', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 7057-00 Без налога (НДС)', 'user' => 'Бушманова Вера Геннадьевна', 'date' => '25.12.2017', 'paid' => '7057');
$array[] = array('amount' => '7292,09', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 7292-09 Без налога (НДС)', 'user' => 'Быков Андрей Анатольевич', 'date' => '25.12.2017', 'paid' => '7292,09');
$array[] = array('amount' => '7240', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 7240-00 Без налога (НДС)', 'user' => 'Веселкова Нина Николаевна', 'date' => '25.12.2017', 'paid' => '595,01');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '26.12.2017', 'paid' => '6644,99');
$array[] = array('amount' => '15007', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 15007-00 Без налога (НДС)', 'user' => 'Владычанская Анна Витальевна', 'date' => '26.12.2017', 'paid' => '12415,73');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '10.01.2018', 'paid' => '2591,27');
$array[] = array('amount' => '23439,28', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 23439-28 Без налога (НДС)', 'user' => 'Волокитин Андрей Сергеевич', 'date' => '26.12.2017', 'paid' => '23439,28');
$array[] = array('amount' => '3001', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 3001-00 Без налога (НДС)', 'user' => 'Гаркуша Андрей Владимирович', 'date' => '10.01.2018', 'paid' => '3001');
$array[] = array('amount' => '3001', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 3001-00 Без налога (НДС)', 'user' => 'Грошева Алена Николаевна', 'date' => '10.01.2018', 'paid' => '3001');
$array[] = array('amount' => '12614,64', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 12614-64 Без налога (НДС)', 'user' => 'Долгов Андрей Валерьевич', 'date' => '10.01.2018', 'paid' => '12614,64');
$array[] = array('amount' => '9663,2', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 9663-20 Без налога (НДС)', 'user' => 'Дягилев Юрий Николаевич', 'date' => '10.01.2018', 'paid' => '9663,2');
$array[] = array('amount' => '9289,27', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 9289-27 Без налога (НДС)', 'user' => 'Егоров Валерий Вадимович', 'date' => '10.01.2018', 'paid' => '9289,27');
$array[] = array('amount' => '8691,7', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 8691-70 Без налога (НДС)', 'user' => 'Ершов Виктор Владимирович', 'date' => '10.01.2018', 'paid' => '8691,7');
$array[] = array('amount' => '9289,27', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 9289-27 Без налога (НДС)', 'user' => 'Залесский Дмитрий Анатольевич', 'date' => '10.01.2018', 'paid' => '9289,27');
$array[] = array('amount' => '12217,79', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 12217-79 Без налога (НДС)', 'user' => 'Калинин Алексей Валерьевич', 'date' => '10.01.2018', 'paid' => '10258,65');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '11.01.2018', 'paid' => '1959,14');
$array[] = array('amount' => '6854,24', 'description' => 'Текущий платёж перечисление заработной платы за май 2017 год. Сумма 6854-24 Без налога (НДС)', 'user' => 'Киселев Василий Павлович', 'date' => '11.01.2018', 'paid' => '4040,86');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '02.04.2018', 'paid' => '2813,38');
$array[] = array('amount' => '8506', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 8506-00 Без налога (НДС)', 'user' => 'Коновалова Алла Васильевна', 'date' => '02.04.2018', 'paid' => '8506');
$array[] = array('amount' => '10604,18', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 10604-18 Без налога (НДС)', 'user' => 'Красильников Александр Николаевич', 'date' => '02.04.2018', 'paid' => '10604,18');
$array[] = array('amount' => '10787,18', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 10787-18 Без налога (НДС)', 'user' => 'Красильников Анатолий Николаевич', 'date' => '02.04.2018', 'paid' => '10787,18');
$array[] = array('amount' => '5025,86', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 5025-86 Без налога (НДС)', 'user' => 'Круглов Николай Александрович', 'date' => '02.04.2018', 'paid' => '5025,86');
$array[] = array('amount' => '7705,05', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 7705-05 Без налога (НДС)', 'user' => 'Лапшин Леонид Анатольевич', 'date' => '02.04.2018', 'paid' => '7705,05');
$array[] = array('amount' => '8034,2', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 8034-20 Без налога (НДС)', 'user' => 'Леонов Владимир Валерьевич', 'date' => '02.04.2018', 'paid' => '8034,2');
$array[] = array('amount' => '8849,2', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 8849-20 Без налога (НДС)', 'user' => 'Логинов Геннадий Валерианович', 'date' => '02.04.2018', 'paid' => '8849,2');
$array[] = array('amount' => '7720,73', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 7720-73 Без налога (НДС)', 'user' => 'Малышев Александр Сергеевич', 'date' => '02.04.2018', 'paid' => '7720,73');
$array[] = array('amount' => '17075,67', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 17075-67 Без налога (НДС)', 'user' => 'Маслова Валентина Юрьевна', 'date' => '02.04.2018', 'paid' => '17075,67');
$array[] = array('amount' => '12760,98', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 12760-98 Без налога (НДС)', 'user' => 'Матюшин Александр Леонидович', 'date' => '02.04.2018', 'paid' => '9945,36');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '12.04.2018', 'paid' => '2815,62');
$array[] = array('amount' => '7058', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 7058-00 Без налога (НДС)', 'user' => 'Миронова Ирина Леонидовна', 'date' => '12.04.2018', 'paid' => '7058');
$array[] = array('amount' => '12006', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 12006-00 Без налога (НДС)', 'user' => 'Миронова Наталья Валерьевна', 'date' => '12.04.2018', 'paid' => '12006');
$array[] = array('amount' => '16265,39', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 16265-39 Без налога (НДС)', 'user' => 'Митин Сергей Вадимович', 'date' => '12.04.2018', 'paid' => '16265,39');
$array[] = array('amount' => '12613,64', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 12613-64 Без налога (НДС)', 'user' => 'Молотобойцев Денис Юрьевич', 'date' => '12.04.2018', 'paid' => '12613,64');
$array[] = array('amount' => '9385,32', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 9385-32 Без налога (НДС)', 'user' => 'Паничев Геннадий Валерьевич', 'date' => '12.04.2018', 'paid' => '9385,32');
$array[] = array('amount' => '3002', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 3002-00 Без налога (НДС)', 'user' => 'Пантелеева Наталья Михайловна', 'date' => '12.04.2018', 'paid' => '3002');
$array[] = array('amount' => '2551,5', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 2551-50 Без налога (НДС)', 'user' => 'Пелевина Татьяна Юрьевна', 'date' => '12.04.2018', 'paid' => '2551,5');
$array[] = array('amount' => '10286,6', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 10286-60 Без налога (НДС)', 'user' => 'Постников Вадим Валентинович', 'date' => '12.04.2018', 'paid' => '10286,6');
$array[] = array('amount' => '7424,63', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 7424-63 Без налога (НДС)', 'user' => 'Родионов Сергей Викторович', 'date' => '12.04.2018', 'paid' => '7424,63');
$array[] = array('amount' => '13007,01', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 13007-01 Без налога (НДС)', 'user' => 'Савченко Ирина Сергеевна', 'date' => '12.04.2018', 'paid' => '13007,01');
$array[] = array('amount' => '32807,04', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 32807-04 Без налога (НДС)', 'user' => 'Свечинова Любовь Андреевна', 'date' => '12.04.2018', 'paid' => '3584,29');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '16.04.2018', 'paid' => '29222,75');
$array[] = array('amount' => '50207', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 50207-00 Без налога (НДС)', 'user' => 'Седов Евгений Николаевич', 'date' => '16.04.2018', 'paid' => '5777,25');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '17.04.2018', 'paid' => '44429,75');
$array[] = array('amount' => '70035', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Без налога (НДС)', 'user' => 'Седов Николай Мартьянович', 'date' => '17.04.2018', 'paid' => '70035');
$array[] = array('amount' => '11199,54', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 11199-54 Без налога (НДС)', 'user' => 'Сидоренков Иван Сергеевич', 'date' => '17.04.2018', 'paid' => '11199,54');
$array[] = array('amount' => '3001', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 3001-00 Без налога (НДС)', 'user' => 'Слыхалов Александр Владимирович', 'date' => '17.04.2018', 'paid' => '3001');
$array[] = array('amount' => '20810,99', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 20810-99 Без налога (НДС)', 'user' => 'Смирнов Юрий Александрович', 'date' => '17.04.2018', 'paid' => '20810,99');
$array[] = array('amount' => '14371', 'description' => 'Текущий платёж перечисление вторая очередь заработной платы за май 2017 год. Сумма 14371-00 Без налога (НДС)', 'user' => 'Смирнова Анна Евгеньевна', 'date' => '17.04.2018', 'paid' => '14371');
$array[] = array('amount' => '11092,91', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 11092-91 Без налога (НДС)', 'user' => 'Смыслов Сергей Валентинович', 'date' => '17.04.2018', 'paid' => '11092,91');
$array[] = array('amount' => '9892,73', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 9892-73 Без налога (НДС)', 'user' => 'Соколов Николай Дмитриевич', 'date' => '17.04.2018', 'paid' => '9892,73');
$array[] = array('amount' => '16008', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 16008-00 Без налога (НДС)', 'user' => 'Сочнева Анна Алексеевна', 'date' => '17.04.2018', 'paid' => '16008');
$array[] = array('amount' => '5237,73', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 5237-73 Без налога (НДС)', 'user' => 'Субботин Сергей Александрович', 'date' => '17.04.2018', 'paid' => '5237,73');
$array[] = array('amount' => '5306,6', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 5306-60 Без налога (НДС)', 'user' => 'Токарева Татьяна Александровна', 'date' => '17.04.2018', 'paid' => '5306,6');
$array[] = array('amount' => '33115,17', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 33115-17 Без налога (НДС)', 'user' => 'Трунин Андрей Геннадьевич', 'date' => '17.04.2018', 'paid' => '3614,75');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '18.04.2018', 'paid' => '29500,42');
$array[] = array('amount' => '10633,3', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 10633-30 Без налога (НДС)', 'user' => 'Хапов Юрий Валентинович', 'date' => '18.04.2018', 'paid' => '10633,3');
$array[] = array('amount' => '23928,17', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 23928-17 Без налога (НДС)', 'user' => 'Шилов Николай Александрович', 'date' => '18.04.2018', 'paid' => '9866,28');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '25.04.2018', 'paid' => '14061,89');
$array[] = array('amount' => '9663,2', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 9663-20 Без налога (НДС)', 'user' => 'Шнуров Игорь Алексеевич', 'date' => '25.04.2018', 'paid' => '9663,2');
$array[] = array('amount' => '27931,76', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за май 2017 год. Сумма 27931-76 Без налога (НДС)', 'user' => 'Щеглов Алексей Викторович', 'date' => '25.04.2018', 'paid' => '26274,91');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '27.04.2018', 'paid' => '1656,85');
$array[] = array('amount' => '3803,31', 'description' => 'Текущий платёж 2 очередь перечисление заработной платы за июнь 2017 год. НДС не облагается.', 'user' => 'Богданов Алексей Емельянович', 'date' => '27.04.2018', 'paid' => '3803,31');
$array[] = array('amount' => '9832,2', 'description' => 'Текущий платёж перечисление заработной платы за июнь 2017 год. НДС не облагается.', 'user' => 'Борисов Алексей Алексеевич', 'date' => '27.04.2018', 'paid' => '9832,2');
$array[] = array('amount' => '8242,64', 'description' => 'Текущий платёж перечисление заработной платы за июнь 2017 год. НДС не облагается.', 'user' => 'Бушманова Вера Геннадьевна', 'date' => '27.04.2018', 'paid' => '8242,64');
$array[] = array('amount' => '7172,27', 'description' => 'Текущий платёж перечисление заработной платы за июнь 2017 год. НДС не облагается.', 'user' => 'Быков Андрей Анатольевич', 'date' => '27.04.2018', 'paid' => '7172,27');
$array[] = array('amount' => '3002', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 3001-00 Без налога (НДС)', 'user' => 'Грошева Алена Николаевна', 'date' => '27.04.2018', 'paid' => '3002');
$array[] = array('amount' => '6736,8', 'description' => 'Текущий платёж перечисление заработной платы за июнь 2017 год. Сумма 6736-80 Без налога (НДС)', 'user' => 'Веселкова Нина Николаевна', 'date' => '27.04.2018', 'paid' => '6736,8');
$array[] = array('amount' => '15008', 'description' => 'Текущий платёж перечисление заработной платы за июнь 2017 год. Сумма 15008-00 Без налога (НДС)', 'user' => 'Владычанская Анна Витальевна', 'date' => '27.04.2018', 'paid' => '15008');
$array[] = array('amount' => '17717,34', 'description' => 'Текущий платёж перечисление заработной платы за июнь 2017 год. Сумма 17717-34 Без налога (НДС)', 'user' => 'Волокитин Андрей Сергеевич', 'date' => '27.04.2018', 'paid' => '1543,93');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '28.04.2018', 'paid' => '16173,41');
$array[] = array('amount' => '3002', 'description' => 'Текущий платёж перечисление заработной платы за июнь 2017 год. Сумма 3002-00 Без налога (НДС)', 'user' => 'Гаркуша Андрей Владимирович', 'date' => '27.04.2018', 'paid' => '3002');
$array[] = array('amount' => '9832,2', 'description' => 'Текущий платёж перечисление заработной платы за июнь 2017 год. Сумма 9832-20 Без налога (НДС)', 'user' => 'Долгов Андрей Валерьевич', 'date' => '28.04.2018', 'paid' => '3826,59');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '04.05.2018', 'paid' => '6005,61');
$array[] = array('amount' => '8975,88', 'description' => 'Текущий платёж перечисление заработной платы за июнь 2017 год. Сумма 8975-88 Без налога (НДС)', 'user' => 'Дягилев Юрий Николаевич', 'date' => '04.05.2018', 'paid' => '8975,88');
$array[] = array('amount' => '4542,74', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 4542-74 Без налога (НДС)', 'user' => 'Егоров Валерий Вадимович', 'date' => '04.05.2018', 'paid' => '4542,74');
$array[] = array('amount' => '19024,77', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 19024-77 Без налога (НДС)', 'user' => 'Залесский Дмитрий Анатольевич', 'date' => '04.05.2018', 'paid' => '19024,77');
$array[] = array('amount' => '18262,76', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 18262-76 Без налога (НДС)', 'user' => 'Ершов Виктор Владимирович', 'date' => '04.05.2018', 'paid' => '6949,76');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '14.05.2018', 'paid' => '11313');
$array[] = array('amount' => '16510,97', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 16510-97 Без налога (НДС)', 'user' => 'Киселев Василий Павлович', 'date' => '14.05.2018', 'paid' => '687');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '06.06.2018', 'paid' => '15823,97');
$array[] = array('amount' => '8034,35', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 8034-35 Без налога (НДС)', 'user' => 'Коновалова Алла Васильевна', 'date' => '06.06.2018', 'paid' => '8034,35');
$array[] = array('amount' => '4788', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 4788-00 Без налога (НДС)', 'user' => 'Красильников Александр Николаевич', 'date' => '06.06.2018', 'paid' => '4788');
$array[] = array('amount' => '4886,97', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 4886-97 Без налога (НДС)', 'user' => 'Красильников Анатолий Николаевич', 'date' => '06.06.2018', 'paid' => '4886,97');
$array[] = array('amount' => '2334,69', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 2334-69 Без налога (НДС)', 'user' => 'Круглов Николай Александрович', 'date' => '06.06.2018', 'paid' => '2334,69');
$array[] = array('amount' => '9188,67', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 9188-67 Без налога (НДС)', 'user' => 'Лапшин Леонид Анатольевич', 'date' => '06.06.2018', 'paid' => '9188,67');
$array[] = array('amount' => '2785,64', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 2785-64 Без налога (НДС)', 'user' => 'Леонов Владимир Валерьевич', 'date' => '06.06.2018', 'paid' => '2785,64');
$array[] = array('amount' => '23463,52', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 23463-52 Без налога (НДС)', 'user' => 'Логинов Геннадий Валерианович', 'date' => '06.06.2018', 'paid' => '23463,52');
$array[] = array('amount' => '7171,27', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 7171-27 Без налога (НДС)', 'user' => 'Малышев Александр Сергеевич', 'date' => '06.06.2018', 'paid' => '7171,27');
$array[] = array('amount' => '16008', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 16008-00 Без налога (НДС)', 'user' => 'Маслова Валентина Юрьевна', 'date' => '06.06.2018', 'paid' => '6560,68');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '21.06.2018', 'paid' => '4108,53');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '26.06.2018', 'paid' => '362');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '27.06.2018', 'paid' => '4976,79');
$array[] = array('amount' => '11195,12', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 11195-12 Без налога (НДС)', 'user' => 'Матюшин Александр Леонидович', 'date' => '27.06.2018', 'paid' => '7023,21');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '28.06.2018', 'paid' => '4171,91');
$array[] = array('amount' => '14932,04', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 14932-04 Без налога (НДС)', 'user' => 'Миронова Ирина Леонидовна', 'date' => '06.06.2018', 'paid' => '14932,04');
$array[] = array('amount' => '12942,4', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 12942-40 Без налога (НДС)', 'user' => 'Митин Сергей Вадимович', 'date' => '28.06.2018', 'paid' => '12942,4');
$array[] = array('amount' => '9833,2', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 9833-20 Без налога (НДС)', 'user' => 'Молотобойцев Денис Юрьевич', 'date' => '28.06.2018', 'paid' => '9833,2');
$array[] = array('amount' => '7172,27', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 7172-27 Без налога (НДС)', 'user' => 'Паничев Геннадий Валерьевич', 'date' => '28.06.2018', 'paid' => '7172,27');
$array[] = array('amount' => '3001', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 3001-00 Без налога (НДС)', 'user' => 'Пантелеева Наталья Михайловна', 'date' => '28.06.2018', 'paid' => '3001');
$array[] = array('amount' => '1989,02', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 1989-02 Без налога (НДС)', 'user' => 'Пелевина Татьяна Юрьевна', 'date' => '28.06.2018', 'paid' => '1989,02');
$array[] = array('amount' => '7354,27', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 7354-27 Без налога (НДС)', 'user' => 'Постников Вадим Валентинович', 'date' => '28.06.2018', 'paid' => '7354,27');
$array[] = array('amount' => '10422,37', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 10422-37 Без налога (НДС)', 'user' => 'Родионов Сергей Викторович', 'date' => '05.07.2018', 'paid' => '10422,37');
$array[] = array('amount' => '5341,41', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 5341-41 Без налога (НДС)', 'user' => 'Савченко Ирина Сергеевна', 'date' => '05.07.2018', 'paid' => '5341,41');
$array[] = array('amount' => '29813,24', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 29813-24 Без налога (НДС)', 'user' => 'Свечинова Любовь Андреевна', 'date' => '28.06.2018', 'paid' => '7329,98');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '05.07.2018', 'paid' => '22483,26');
$array[] = array('amount' => '110472,13', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 110472-13 Без налога (НДС)', 'user' => 'Седов Евгений Николаевич', 'date' => '05.09.2018', 'paid' => '51721,85');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '22.05.2019', 'paid' => '58750,28');
$array[] = array('amount' => '70035', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 70035-00 Без налога (НДС)', 'user' => 'Седов Николай Мартьянович', 'date' => '10.07.2018', 'paid' => '61916,6');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '26.07.2018', 'paid' => '8118,4');
$array[] = array('amount' => '8401,48', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 8401-48 Без налога (НДС)', 'user' => 'Сидоренков Иван Сергеевич', 'date' => '26.07.2018', 'paid' => '8401,48');
$array[] = array('amount' => '3002', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 3002-00 Без налога (НДС)', 'user' => 'Слыхалов Александр Владимирович', 'date' => '10.07.2018', 'paid' => '3002');
$array[] = array('amount' => '13096,65', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 13096-65 Без налога (НДС)', 'user' => 'Смирнов Юрий Александрович', 'date' => '26.07.2018', 'paid' => '3554,52');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '05.09.2018', 'paid' => '9542,13');
$array[] = array('amount' => '25234,36', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 25234-36 Без налога (НДС)', 'user' => 'Смирнова Анна Евгеньевна', 'date' => '05.07.2018', 'paid' => '5152,96');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '10.07.2018', 'paid' => '20081,4');
$array[] = array('amount' => '2905,79', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 2905-79 Без налога (НДС)', 'user' => 'Смыслов Сергей Валентинович', 'date' => '22.05.2019', 'paid' => '2905,79');
$array[] = array('amount' => '12298,44', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 12298-44 Без налога (НДС)', 'user' => 'Сочнева Анна Алексеевна', 'date' => '22.05.2019', 'paid' => '12298,44');
$array[] = array('amount' => '8219,48', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 8219-48 Без налога (НДС)', 'user' => 'Субботин Сергей Александрович', 'date' => '22.05.2019', 'paid' => '8219,48');
$array[] = array('amount' => '60884,95', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 60884-95 Без налога (НДС)', 'user' => 'Трунин Андрей Геннадьевич', 'date' => '22.05.2019', 'paid' => '60884,95');
$array[] = array('amount' => '10470,17', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 10470-17 Без налога (НДС)', 'user' => 'Хапов Юрий Валентинович', 'date' => '22.05.2019', 'paid' => '10470,17');
$array[] = array('amount' => '3936,91', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 3936-91 Без налога (НДС)', 'user' => 'Шилов Николай Александрович', 'date' => '22.05.2019', 'paid' => '3936,91');
$array[] = array('amount' => '17228,78', 'description' => 'Текущий платёж вторая очередь перечисление заработной платы за июнь 2017 год. Сумма 17228-78 Без налога (НДС)', 'user' => 'Шнуров Игорь Алексеевич', 'date' => '22.05.2019', 'paid' => '17228,78');
$array[] = array('amount' => '229047', 'description' => 'Текущий платёж вторая очередь Налог на доходы физических лиц за апрель 2017 год.', 'user' => 'УФК по Вологодской области (Межрайонная ИФНС России № 11 по Вологодской области)', 'date' => '22.05.2019', 'paid' => '229047');
$array[] = array('amount' => '381119,74', 'description' => 'Текущий платеж вторая очередь Страховые взносы на выплату страховой части трудовой пенсии за апрель 2017 г.', 'user' => 'УФК по Вологодской области (Межрайонная ИФНС России № 11 по Вологодской области)', 'date' => '22.05.2019', 'paid' => '89130,53');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '23.05.2019', 'paid' => '16842,89');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '29.05.2019', 'paid' => '22700');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '27.06.2019', 'paid' => '252446,32');
$array[] = array('amount' => '248295,31', 'description' => 'Текущий платеж вторая очередь Страховые взносы на выплату страховой части трудовой пенсии за апрель 2017 г.', 'user' => 'УФК по Вологодской области (Межрайонная ИФНС России № 11 по Вологодской области)', 'date' => '19.08.2019', 'paid' => '248295,31');
$array[] = array('amount' => '148747', 'description' => 'Текущий платёж вторая очередь Налог на доходы физических лиц за май 2017 года', 'user' => 'УФК по Вологодской области (Межрайонная ИФНС России № 11 по Вологодской области)', 'date' => '27.06.2019', 'paid' => '148747');
$array[] = array('amount' => '251042,12', 'description' => 'Текущий платёж вторая очередь Страховые взносы на выплату страховой части трудовой пенсии за май 2017 год.', 'user' => 'УФК по Вологодской области (Межрайонная ИФНС России № 11 по Вологодской области)', 'date' => '27.06.2019', 'paid' => '251042,12');
$array[] = array('amount' => '104403', 'description' => 'Текущий платёж вторая очередь Налог на доходы физических лиц за июнь 2017 года', 'user' => 'УФК по Вологодской области (Межрайонная ИФНС России № 11 по Вологодской области)', 'date' => '27.06.2019', 'paid' => '104403');
$array[] = array('amount' => '105334,68', 'description' => 'Текущий платёж вторая очередь Страховые взносы на выплату страховой части трудовой пенсии за июнь 2017 год.', 'user' => 'УФК по Вологодской области (Межрайонная ИФНС России № 11 по Вологодской области)', 'date' => '27.06.2019', 'paid' => '105334,68');
$array[] = array('amount' => '8219,48', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Субботин Сергей Александрович', 'date' => '27.06.2019', 'paid' => '8219,48');
$array[] = array('amount' => '8974,8', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Дягилев Юрий Николаевич', 'date' => '27.06.2019', 'paid' => '8974,8');
$array[] = array('amount' => '6737,8', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Веселкова Нина Николаевна', 'date' => '21.01.2020 произведена оплата, денежные средства вернулись в связи с закрытием счета. Запрошены новые реквизиты', 'paid' => '');
$array[] = array('amount' => '16008', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Маслова Валентина Юрьевна ', 'date' => '27.06.2019', 'paid' => '16008');
$array[] = array('amount' => '7403,95', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Постников Вадим Валентинович', 'date' => '27.06.2019', 'paid' => '7403,95');
$array[] = array('amount' => '7171,27', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Быков Андрей Анатольевич', 'date' => '27.06.2019', 'paid' => '7171,27');
$array[] = array('amount' => '15008', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Владычанская Анна Витальевна ', 'date' => '27.06.2019', 'paid' => '15008');
$array[] = array('amount' => '3001', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Гаркуша Андрей Владимирович ', 'date' => '27.06.2019', 'paid' => '3001');
$array[] = array('amount' => '9833,2', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Долгов Андрей Валерьевич', 'date' => '27.06.2019', 'paid' => '9833,2');
$array[] = array('amount' => '7172,27', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Малышев Александр Сергеевич ', 'date' => '27.06.2019', 'paid' => '7172,27');
$array[] = array('amount' => '12942,4', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Митин Сергей Вадимович ', 'date' => '21.01.2020', 'paid' => '12942,4');
$array[] = array('amount' => '9832,2', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Молотобойцев Денис Юрьевич', 'date' => '21.01.2020', 'paid' => '9832,2');
$array[] = array('amount' => '3002', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Пантелеева Наталья Михайловна ', 'date' => '21.01.2020', 'paid' => '3002');
$array[] = array('amount' => '70035', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Седов Николай Мартьянович ', 'date' => '21.01.2020', 'paid' => '70035');
$array[] = array('amount' => '6829,73', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Паничев Геннадий Валерьевич ', 'date' => '27.06.2019', 'paid' => '6829,73');
$array[] = array('amount' => '11194,12', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Матюшин Александр Леонидович', 'date' => '21.01.2020', 'paid' => '11194,12');
$array[] = array('amount' => '9833,2', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Борисов Алексей Алексеевич', 'date' => '21.01.2020', 'paid' => '9833,2');
$array[] = array('amount' => '9188,67', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Лапшин Леонид Анатольевич ', 'date' => '21.01.2020', 'paid' => '9188,67');
$array[] = array('amount' => '8400,48', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Сидоренков Иван Сергеевич', 'date' => '21.01.2020', 'paid' => '8400,48');
$array[] = array('amount' => '9188,67', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Соколов Николай Дмитриевич', 'date' => '21.01.2020', 'paid' => '9188,67');
$array[] = array('amount' => '3001', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Пелевина Татьяна Юрьевна ', 'date' => '21.01.2020', 'paid' => '3001');
$array[] = array('amount' => '3001', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Грошева Алена Николаевна ', 'date' => '21.01.2020', 'paid' => '3001');
$array[] = array('amount' => '3001', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За июль 2017 года', 'user' => 'Слыхалов Александр Владимирович', 'date' => '21.01.2020 произведена оплата, денежные средства вернулись в связи с закрытием счета. Запрошены новые реквизиты', 'paid' => '');
$array[] = array('amount' => '62823', 'description' => 'Оплата задолженности по текущим налогам и обязательным платежам. ПФР за июль 2017г.', 'user' => 'МЕЖРАЙОННАЯ ИФНС РОССИИ № 11 ПО ВОЛОГОДСКОЙ ОБЛАСТИ, 160000, ОБЛАСТЬ ВОЛОГОДСКАЯ, ГОРОД ВОЛОГДА, УЛИЦА ГЕРЦЕНА, ДОМ 1.', 'date' => '21.01.2020', 'paid' => '62823');
$array[] = array('amount' => '36581', 'description' => 'Оплата задолженности по текущим налогам и обязательным платежам. НДФЛ за июль 2017г.', 'user' => 'МЕЖРАЙОННАЯ ИФНС РОССИИ № 11 ПО ВОЛОГОДСКОЙ ОБЛАСТИ, 160000, ОБЛАСТЬ ВОЛОГОДСКАЯ, ГОРОД ВОЛОГДА, УЛИЦА ГЕРЦЕНА, ДОМ 1.', 'date' => '21.01.2020', 'paid' => '36581');
$array[] = array('amount' => '44929,73', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Субботин Сергей Александрович', 'date' => '27.07.2020', 'paid' => '17119,59');
$array[] = array('amount' => '164983,4', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Седов Евгений Николаевич ', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '46571,6', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Дягилев Юрий Николаевич', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '36471,57', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Веселкова Нина Николаевна', 'date' => '28.07.2020 произведена оплата, денежные средства вернулись в связи с закрытием счета. Запрошены новые реквизиты', 'paid' => '');
$array[] = array('amount' => '71288,02', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Маслова Валентина Юрьевна ', 'date' => '27.07.2020', 'paid' => '71288,02');
$array[] = array('amount' => '40416,09', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Быков Андрей Анатольевич', 'date' => '27.07.2020', 'paid' => '40416,09');
$array[] = array('amount' => '38064,9', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Владычанская Анна Витальевна ', 'date' => '27.07.2020', 'paid' => '38064,9');
$array[] = array('amount' => '4763,45', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Гаркуша Андрей Владимирович ', 'date' => '27.07.2020', 'paid' => '4763,45');
$array[] = array('amount' => '49327,77', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Долгов Андрей Валерьевич', 'date' => '27.07.2020', 'paid' => '49327,77');
$array[] = array('amount' => '48384,24', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Малышев Александр Сергеевич ', 'date' => '27.07.2020', 'paid' => '48384,24');
$array[] = array('amount' => '53467,81', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Митин Сергей Вадимович ', 'date' => '27.07.2020', 'paid' => '53467,81');
$array[] = array('amount' => '31239,25', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Молотобойцев Денис Юрьевич', 'date' => '27.07.2020', 'paid' => '31239,25');
$array[] = array('amount' => '7115,57', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Пантелеева Наталья Михайловна ', 'date' => '27.07.2020', 'paid' => '7115,57');
$array[] = array('amount' => '285197,99', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Седов Николай Мартьянович ', 'date' => '17.07.2020', 'paid' => '46199,11');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '27.07.2020', 'paid' => '238998,88');
$array[] = array('amount' => '47274,64', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Паничев Геннадий Валерьевич ', 'date' => '21.01.2020', 'paid' => '10261,26');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '21.01.2020', 'paid' => '10705,98');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '30.06.2020', 'paid' => '11569,04');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '17.07.2020', 'paid' => '14738,36');
$array[] = array('amount' => '60122,21', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Матюшин Александр Леонидович', 'date' => '21.01.2020', 'paid' => '60122,21');
$array[] = array('amount' => '56337,56', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Борисов Алексей Алексеевич', 'date' => '21.01.2020', 'paid' => '56337,56');
$array[] = array('amount' => '46185,57', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Лапшин Леонид Анатольевич ', 'date' => '21.01.2020', 'paid' => '46185,57');
$array[] = array('amount' => '51888,08', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Сидоренков Иван Сергеевич', 'date' => '12.07.2019', 'paid' => '51888,08');
$array[] = array('amount' => '45339,41', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Соколов Николай Дмитриевич', 'date' => '12.07.2019', 'paid' => '45339,41');
$array[] = array('amount' => '8216,61', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Пелевина Татьяна Юрьевна ', 'date' => '21.01.2020', 'paid' => '8216,61');
$array[] = array('amount' => '5672,02', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Грошева Алена Николаевна ', 'date' => '12.07.2019', 'paid' => '5672,02');
$array[] = array('amount' => '10152,47', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Шилов Николай Александрович', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '20088,35', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Миронова Наталья Валерьевна', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '9188,67', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Соколов Николай Дмитриевич', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '19861,09', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Щеглов Алексей Викторович', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '7140,71', 'description' => 'Погашение требования об оплате труда лиц, работающих по трудовым договорам в процедуре конкурсного производства. За август 2017 года', 'user' => 'Слыхалов Александр Владимирович', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '161814', 'description' => 'Оплата задолженности по текущим налогам и обязательным платежам. ПФР за август 2017г.', 'user' => 'МЕЖРАЙОННАЯ ИФНС РОССИИ № 11 ПО ВОЛОГОДСКОЙ ОБЛАСТИ, 160000, ОБЛАСТЬ ВОЛОГОДСКАЯ, ГОРОД ВОЛОГДА, УЛИЦА ГЕРЦЕНА, ДОМ 1.', 'date' => '12.07.2019', 'paid' => '801,14');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '15.07.2019', 'paid' => '6583,21');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '18.07.2019', 'paid' => '36785');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '26.07.2019', 'paid' => '5810,99');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '95070', 'description' => 'Оплата задолженности по текущим налогам и обязательным платежам. НДФЛ за август 2017г.', 'user' => 'МЕЖРАЙОННАЯ ИФНС РОССИИ № 11 ПО ВОЛОГОДСКОЙ ОБЛАСТИ, 160000, ОБЛАСТЬ ВОЛОГОДСКАЯ, ГОРОД ВОЛОГДА, УЛИЦА ГЕРЦЕНА, ДОМ 1.', 'date' => '27.06.2019', 'paid' => '15019,4');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '28.06.2019', 'paid' => '4510,45');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '04.07.2019', 'paid' => '61182,41');
$array[] = array('amount' => '', 'description' => '', 'user' => '', 'date' => '12.07.2019', 'paid' => '14357,74');
$array[] = array('amount' => '500', 'description' => 'Компенсация за задержку выплаты заработной платы. Решение Вологодсого городского суда по делу № 2-9444/2017 ОТ 18.10.2017Г. ', 'user' => 'Пелевина Татьяна Юрьевна', 'date' => '27.06.2019', 'paid' => '500');
$array[] = array('amount' => '229047', 'description' => 'Оплата задолженности по текущим налогам и обязательным платежам. НДФЛ за 4 кв 2017г.', 'user' => 'МЕЖРАЙОННАЯ ИФНС РОССИИ № 11 ПО ВОЛОГОДСКОЙ ОБЛАСТИ, 160000, ОБЛАСТЬ ВОЛОГОДСКАЯ, ГОРОД ВОЛОГДА, УЛИЦА ГЕРЦЕНА, ДОМ 1.', 'date' => '27.06.2019', 'paid' => '229047');
$array[] = array('amount' => '18501', 'description' => 'Компенсация за задержку выплаты заработной платы. Заочное решение Вологодского городского суда', 'user' => 'Трунин Андрей Геннадьевич', 'date' => '27.06.2019', 'paid' => '18501');
$array[] = array('amount' => '12000', 'description' => 'Компенсация за задержку выплаты заработной платы. Заочное решение Вологодского городского суда', 'user' => 'Трунин Андрей Геннадьевич', 'date' => '27.06.2019', 'paid' => '12000');
$array[] = array('amount' => '22269,87', 'description' => 'Выплата средней зереботной платы на период трудоустройства за 2 месяц (октябрь 2017 года)', 'user' => 'Паничев Геннадий Валерьевич', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '25214,49', 'description' => 'Выплата средней зереботной платы на период трудоустройства за 2 месяц (октябрь 2017 года)', 'user' => 'Быков Андрей Анатольевич', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '22269,87', 'description' => 'Выплата средней зереботной платы на период трудоустройства за 3 месяц (ноябрь 2017 года)', 'user' => 'Паничев Геннадий Валерьевич', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '25214,49', 'description' => 'Выплата средней зереботной платы на период трудоустройства за 3 месяц (ноябрь 2017 года)', 'user' => 'Быков Андрей Анатольевич', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '61621,78', 'description' => 'Выплата средней зереботной платы на период трудоустройства за 2 месяц (октябрь 2017 года)', 'user' => 'Седов Евгений Николаевич', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '58820,79', 'description' => 'Выплата средней зереботной платы на период трудоустройства за 3 месяц (ноябрь 2017 года)', 'user' => 'Седов Евгений Николаевич', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '1837,99', 'description' => 'Компенсация при увольнении, компенсация за неиспользованный отпуск (декабрь 2019 года)', 'user' => 'Пискунова Юлия Эдуардовна', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '138', 'description' => 'НДФЛ за декабрь 2019 года', 'user' => 'МЕЖРАЙОННАЯ ИФНС РОССИИ № 11 ПО ВОЛОГОДСКОЙ ОБЛАСТИ, 160000, ОБЛАСТЬ ВОЛОГОДСКАЯ, ГОРОД ВОЛОГДА, УЛИЦА ГЕРЦЕНА, ДОМ 1.', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '3965,13', 'description' => 'Компенсация при увольнении, компенсация за неиспользованный отпуск (январь 2020 года)', 'user' => 'Бачурина Елена Александровна', 'date' => '00.01.1900', 'paid' => '');
$array[] = array('amount' => '147', 'description' => 'НДФЛ за январь 2020 года', 'user' => 'МЕЖРАЙОННАЯ ИФНС РОССИИ № 11 ПО ВОЛОГОДСКОЙ ОБЛАСТИ, 160000, ОБЛАСТЬ ВОЛОГОДСКАЯ, ГОРОД ВОЛОГДА, УЛИЦА ГЕРЦЕНА, ДОМ 1.', 'date' => '00.01.1900', 'paid' => '');

$users[] = array('name' => 'Белов Алексей Николаевич', 'date' => '27.04.2017');
$users[] = array('name' => 'Белозеров Василий Сергеевич', 'date' => '18.04.2017');
$users[] = array('name' => 'Богданов Алексей Емельянович', 'date' => '01.06.2017');
$users[] = array('name' => 'Бодунов Артем Вячеславович', 'date' => '02.06.2017');
$users[] = array('name' => 'Борисов Алексей Алексеевич', 'date' => '14.08.2017');
$users[] = array('name' => 'Борисов Сергей Николаевич', 'date' => '01.06.2017');
$users[] = array('name' => 'Бречалов Николай Алексеевич', 'date' => '24.04.2017');
$users[] = array('name' => 'Будаев Андрей Игоревич', 'date' => '16.05.2017');
$users[] = array('name' => 'Бушманова Вера Геннадьевна', 'date' => '01.06.2017');
$users[] = array('name' => 'Быков Андрей Анатольевич', 'date' => '14.08.2017');
$users[] = array('name' => 'Веселкова Нина Николаевна', 'date' => '14.08.2017');
$users[] = array('name' => 'Владычанская Анна Витальевна', 'date' => '07.08.2017');
$users[] = array('name' => 'Волокитин Андрей Сергеевич', 'date' => '01.06.2017');
$users[] = array('name' => 'Гаркуша Андрей Владимирович', 'date' => '07.08.2017');
$users[] = array('name' => 'Грошева Алена Николаевна', 'date' => '07.08.2017');
$users[] = array('name' => 'Долгов Андрей Валерьевич', 'date' => '14.08.2017');
$users[] = array('name' => 'Дягилев Юрий Николаевич', 'date' => '14.08.2017');
$users[] = array('name' => 'Егоров Валерий Вадимович', 'date' => '01.06.2017');
$users[] = array('name' => 'Ершов Виктор Владимирович', 'date' => '01.06.2017');
$users[] = array('name' => 'Залесский Дмитрий Анатольевич', 'date' => '01.06.2017');
$users[] = array('name' => 'Калинин Алексей Валерьевич', 'date' => '15.06.2017');
$users[] = array('name' => 'Киселев Василий Павлович', 'date' => '01.06.2017');
$users[] = array('name' => 'Коновалова Алла Васильевна', 'date' => '01.06.2017');
$users[] = array('name' => 'Красильников Александр Николаевич', 'date' => '01.06.2017');
$users[] = array('name' => 'Красильников Анатолий Николаевич', 'date' => '01.06.2017');
$users[] = array('name' => 'Круглов Николай Александрович', 'date' => '01.06.2017');
$users[] = array('name' => 'Лапшин Леонид Анатольевич', 'date' => '14.08.2017');
$users[] = array('name' => 'Леонов Владимир Валерьевич', 'date' => '01.06.2017');
$users[] = array('name' => 'Логинов Геннадий Валерианович', 'date' => '01.06.2017');
$users[] = array('name' => 'Малышев Александр Сергеевич', 'date' => '14.08.2017');
$users[] = array('name' => 'Маслова Валентина Юрьевна', 'date' => '14.08.2017');
$users[] = array('name' => 'Матюшин Александр Леонидович', 'date' => '14.08.2017');
$users[] = array('name' => 'Миронова Ирина Леонидовна', 'date' => '01.06.2017');
$users[] = array('name' => 'Миронова Наталья Валерьевна', 'date' => '03.08.2018');
$users[] = array('name' => 'Митин Сергей Вадимович', 'date' => '14.08.2017');
$users[] = array('name' => 'Михеева Анна Николаевна', 'date' => '10.05.2017');
$users[] = array('name' => 'Молотобойцев Денис Юрьевич', 'date' => '14.08.2017');
$users[] = array('name' => 'Паничев Геннадий Валерьевич', 'date' => '14.08.2017');
$users[] = array('name' => 'Пантелеева Наталья Михайловна', 'date' => '07.08.2017');
$users[] = array('name' => 'Пелевина Татьяна Юрьевна', 'date' => '07.08.2017');
$users[] = array('name' => 'Попова Галина Михайловна', 'date' => '18.04.2017');
$users[] = array('name' => 'Порохова Галина Валентиновна', 'date' => '15.03.2017');
$users[] = array('name' => 'Постников Вадим Валентинович', 'date' => '03.07.2017');
$users[] = array('name' => 'Рогалев Максим Андреевич', 'date' => '24.05.2017');
$users[] = array('name' => 'Родионов Сергей Викторович', 'date' => '01.06.2017');
$users[] = array('name' => 'Савченко Ирина Сергеевна', 'date' => '01.06.2017');
$users[] = array('name' => 'Свечинова Любовь Андреевна', 'date' => '01.06.2017');
$users[] = array('name' => 'Седов Евгений Николаевич', 'date' => '11.08.2017');
$users[] = array('name' => 'Седов Николай Мартьянович', 'date' => '15.08.2017');
$users[] = array('name' => 'Сидоренков Иван Сергеевич', 'date' => '14.08.2017');
$users[] = array('name' => 'Слыхалов Александр Владимирович', 'date' => '07.08.2017');
$users[] = array('name' => 'Смирнов Юрий Александрович', 'date' => '01.06.2017');
$users[] = array('name' => 'Смирнова Анна Евгеньевна', 'date' => '01.06.2017');
$users[] = array('name' => 'Смыслов Сергей Валентинович', 'date' => '01.06.2017');
$users[] = array('name' => 'Снятков Евгений Сергеевич', 'date' => '29.05.2017');
$users[] = array('name' => 'Соколов Николай Дмитриевич', 'date' => '14.08.2017');
$users[] = array('name' => 'Сочнева Анна Алексеевна', 'date' => '01.06.2017');
$users[] = array('name' => 'Субботин Сергей Александрович', 'date' => '14.08.2017');
$users[] = array('name' => 'Токарев Алексей Викторович', 'date' => '31.05.2017');
$users[] = array('name' => 'Токарева Татьяна Александровна', 'date' => '23.06.2017');
$users[] = array('name' => 'Трунин Андрей Геннадьевич', 'date' => '30.06.2017');
$users[] = array('name' => 'Хапов Юрий Валентинович', 'date' => '01.06.2017');
$users[] = array('name' => 'Шилов Николай Александрович', 'date' => '01.06.2017');
$users[] = array('name' => 'Шилова Елена Олеговна', 'date' => '30.05.2017');
$users[] = array('name' => 'Шнуров Игорь Алексеевич', 'date' => '01.06.2017');
$users[] = array('name' => 'Щеглов Алексей Викторович', 'date' => '01.06.2017');
$users[] = array('name' => 'Пискунова Юлия Эдуардовна', 'date' => '30.12.2019');
$users[] = array('name' => 'Бачурина Елена Александровна', 'date' => '20.01.2020');

$users = collect($users)->map(function($value) {
    return ['name' => $value['name'], 'date' => \Carbon\Carbon::parse($value['date'])];
});

$requisites[]=['bik' => '041909644', 'name' => 'Шнуров Игорь Алексеевич', 'bankAccount' => '40817.810.1.12250534918', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Шилов Николай Александрович', 'bankAccount' => '40817.810.4.12250558571', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Хапов Юрий Валентинович', 'bankAccount' => '40817.810.0.12002397526', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Трунин Андрей Геннадьевич', 'bankAccount' => '40817.810.0.12001637973', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Субботин Сергей Александрович', 'bankAccount' => '40817.810.9.12001520465', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Сочнева Анна Алексеевна', 'bankAccount' => '40817.810.7.12001689962', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Смыслов Сергей Валентинович', 'bankAccount' => '40817.810.7.12002160927', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Смирнова Анна Евгеньевна', 'bankAccount' => '40817.810.1.12001200598', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Смирнов Юрий Александрович', 'bankAccount' => '40817.810.8.12002172608', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Слыхалов Александр Владимирович', 'bankAccount' => '40817.810.5.12001892920', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Сидоренков Иван Сергеевич', 'bankAccount' => '40817.810.7.12002398951', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Седов Николай Мартьянович', 'bankAccount' => '40817.810.3.12000021633', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Седов Евгений Николаевич', 'bankAccount' => '40817.810.6.12250558562', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Свечинова Любовь Андреевна', 'bankAccount' => '40817.810.1.12250560322', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Савченко Ирина Сергеевна', 'bankAccount' => '40817.810.5.12002022032', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Родионов Сергей Викторович', 'bankAccount' => '40817.810.0.12250559747', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Постников Вадим Валентинович', 'bankAccount' => '40817.810.7.12002399044', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Пелевина Татьяна Юрьевна', 'bankAccount' => '40817.810.5.12250550356', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Пантелеева Наталья Михайловна', 'bankAccount' => '40817.810.5.12002392746', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Паничев Геннадий Валерьевич', 'bankAccount' => '42307.810.4.12250534854', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Молотобойцев Денис Юрьевич', 'bankAccount' => '40817.810.9.31604014195', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '044030707', 'name' => 'Митин Сергей Вадимович', 'bankAccount' => '40817.810.8.31604009433', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '041909644', 'name' => 'Миронова Ирина Леонидовна', 'bankAccount' => '40817.810.0.12009641974', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Матюшин Александр Леонидович', 'bankAccount' => '40817.810.0.31604009505', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '041909644', 'name' => 'Маслова Валентина Юрьевна', 'bankAccount' => '40817.810.8.12009437197', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Малышев Александр Сергеевич', 'bankAccount' => '40817.810.5.31604009270', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '041909644', 'name' => 'Логинов Геннадий Валерианович', 'bankAccount' => '40817.810.2.12250558548', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Леонов Владимир Валерьевич', 'bankAccount' => '40817.810.9.31604009294', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '044030707', 'name' => 'Лапшин Леонид Анатольевич', 'bankAccount' => '40817.810.6.31604009662', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '041909644', 'name' => 'Круглов Николай Александрович', 'bankAccount' => '40817.810.3.12009687450', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Красильников Анатолий Николаевич', 'bankAccount' => '40817.810.4.31604009260', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '044030707', 'name' => 'Красильников Александр Николаевич', 'bankAccount' => '40817.810.9.31604009252', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '041909644', 'name' => 'Коновалова Алла Васильевна', 'bankAccount' => '40817.810.1.12009657622', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Киселев Василий Павлович', 'bankAccount' => '40817.810.3.12002591886', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Ершов Виктор Владимирович', 'bankAccount' => '40817.810.4.12250558539', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Залесский Дмитрий Анатольевич', 'bankAccount' => '40817.810.6.12002202998', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Егоров Валерий Вадимович', 'bankAccount' => '40817.810.2.12001567487', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Дягилев Юрий Николаевич', 'bankAccount' => '40817.810.4.12009625464', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Долгов Андрей Валерьевич', 'bankAccount' => '40817.810.3.31604009292', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '041909644', 'name' => 'Гаркуша Андрей Владимирович', 'bankAccount' => '40817.810.6.12250031050', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Волокитин Андрей Сергеевич', 'bankAccount' => '40817.810.2.12001501692', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Владычанская Анна Витальевна', 'bankAccount' => '40817.810.7.12002172410', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Веселкова Нина Николаевна', 'bankAccount' => '40817.810.9.12250451644', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Грошева Алена Николаевна', 'bankAccount' => '40817.810.5.12001555746', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Быков Андрей Анатольевич', 'bankAccount' => '40817.810.1.31604014885', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '044030707', 'name' => 'Бушманова Вера Геннадьевна', 'bankAccount' => '40817.810.5.31604009461', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '044030707', 'name' => 'Борисов Алексей Алексеевич', 'bankAccount' => '40817.810.3.31604009250', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '041909644', 'name' => 'Богданов Алексей Емельянович', 'bankAccount' => '40817.810.1.12002585759', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Щеглов Алексей Викторович', 'bankAccount' => '40817.810.5.31604009296', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '041909644', 'name' => 'Токарева Татьяна Александровна', 'bankAccount' => '40817.810.1.12001452113', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Соколов Николай Дмитриевич', 'bankAccount' => '40817.810.5.31604009432', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '041909644', 'name' => 'Миронова Наталья Валерьевна', 'bankAccount' => '40817.810.1.12002172434', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Калинин Алексей Валерьевич', 'bankAccount' => '40817.810.9.31604009498', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '041909644', 'name' => 'Борисов Сергей Николаевич', 'bankAccount' => '40817.810.0.12001471090', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Бодунов Артем Вячеславович', 'bankAccount' => '40817.810.1.12002224052', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Токарев Алексей Викторович', 'bankAccount' => '40817.810.2.12000037109', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Шилова Елена Олеговна', 'bankAccount' => '40817.810.2.12009441408', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Снятков Евгений Сергеевич', 'bankAccount' => '40817.810.1.31604009256', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '044030707', 'name' => 'Рогалев Максим Андреевич', 'bankAccount' => '40817.810.5.31604009267', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '041909644', 'name' => 'Будаев Андрей Игоревич', 'bankAccount' => '40817.810.8.12001632152', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Михеева Анна Николаевна', 'bankAccount' => '40817.810.9.12250668084', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Порохова Галина Валентиновна', 'bankAccount' => '40817.810.6.12250558559', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Попова Галина Михайловна', 'bankAccount' => '40817.810.7.31604009478', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '041909644', 'name' => 'Ершова Светлана Николаевна', 'bankAccount' => '40817.810.0.12001324341', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '044030707', 'name' => 'Бречалов Николай Алексеевич', 'bankAccount' => '40817.810.3.31604009496', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '044030707', 'name' => 'Белозеров Василий Сергеевич', 'bankAccount' => '40817.810.8.31604009297', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '044030707', 'name' => 'Белов Алексей Николаевич', 'bankAccount' => '40817.810.6.31604009439', 'bank' => 'Филиал № 7806 Банка ВТБ (ПАО) г Санкт-Петербург', 'inn' => '7702070139','loroAccount' => '30.101810300000000811'];
$requisites[]=['bik' => '041909644', 'name' => 'Исаковский Иван Васильевич', 'bankAccount' => '40817.810.1.12001207614', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Сивкова Татьяна Васильевна', 'bankAccount' => '40817.810.2.12001567652', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Кузнецов Александр Александрович', 'bankAccount' => '40817.810.7.12001862682', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Юзгина Ольга Альбертовна', 'bankAccount' => '40817.810.2.12001908700', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Бачурина Елена Александровна', 'bankAccount' => '40817.810.3.12002172409', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];
$requisites[]=['bik' => '041909644', 'name' => 'Пискунова Юлия Эдуардовна', 'bankAccount' => '40817.810.0.12002170332', 'bank' => 'ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК', 'inn' => '7707083893','loroAccount' => '30.101810900000000644'];

$requisites = collect($requisites)->map(function($requisite) {
    return [
        'bik' => $requisite['bik'], 
        'user' => trim($requisite['name']), 
        'bankAccount' => str_replace('.', '', $requisite['bankAccount']), 
        'bank' => trim($requisite['bank']), 
        'inn' => $requisite['inn'],
        'loroAccount' => str_replace('.', '', $requisite['loroAccount']),
    ];
});

$payment_day = 15;
$payment_proc = 0.5;
$cbr_koef = 150;
$end_day = \Carbon\Carbon::parse('28.07.2020');
$from_day = \Carbon\Carbon::parse('01.01.2017');

$stavka[] = array('start' => \Carbon\Carbon::parse('14.06.2016'), 'end' => \Carbon\Carbon::parse('18.09.2016'), 'amount' => 10.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('19.09.2016'), 'end' => \Carbon\Carbon::parse('26.03.2017'), 'amount' => 10);
$stavka[] = array('start' => \Carbon\Carbon::parse('27.03.2017'), 'end' => \Carbon\Carbon::parse('01.05.2017'), 'amount' => 9.75);
$stavka[] = array('start' => \Carbon\Carbon::parse('02.05.2017'), 'end' => \Carbon\Carbon::parse('18.06.2017'), 'amount' => 9.25);
$stavka[] = array('start' => \Carbon\Carbon::parse('19.06.2017'), 'end' => \Carbon\Carbon::parse('17.09.2017'), 'amount' => 9);
$stavka[] = array('start' => \Carbon\Carbon::parse('18.09.2017'), 'end' => \Carbon\Carbon::parse('29.10.2017'), 'amount' => 8.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('30.10.2017'), 'end' => \Carbon\Carbon::parse('17.12.2017'), 'amount' => 8.25);
$stavka[] = array('start' => \Carbon\Carbon::parse('18.12.2017'), 'end' => \Carbon\Carbon::parse('11.02.2018'), 'amount' => 7.75);
$stavka[] = array('start' => \Carbon\Carbon::parse('12.02.2018'), 'end' => \Carbon\Carbon::parse('25.03.2018'), 'amount' => 7.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('26.03.2018'), 'end' => \Carbon\Carbon::parse('16.09.2018'), 'amount' => 7.25);
$stavka[] = array('start' => \Carbon\Carbon::parse('17.09.2018'), 'end' => \Carbon\Carbon::parse('16.12.2018'), 'amount' => 7.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('17.12.2018'), 'end' => \Carbon\Carbon::parse('16.06.2019'), 'amount' => 7.75);
$stavka[] = array('start' => \Carbon\Carbon::parse('17.06.2019'), 'end' => \Carbon\Carbon::parse('28.07.2019'), 'amount' => 7.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('29.07.2019'), 'end' => \Carbon\Carbon::parse('08.09.2019'), 'amount' => 7.25);
$stavka[] = array('start' => \Carbon\Carbon::parse('09.09.2019'), 'end' => \Carbon\Carbon::parse('27.10.2019'), 'amount' => 7);
$stavka[] = array('start' => \Carbon\Carbon::parse('28.10.2019'), 'end' => \Carbon\Carbon::parse('15.12.2019'), 'amount' => 6.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('16.12.2019'), 'end' => \Carbon\Carbon::parse('09.02.2020'), 'amount' => 6.25);
$stavka[] = array('start' => \Carbon\Carbon::parse('10.02.2020'), 'end' => \Carbon\Carbon::parse('26.04.2020'), 'amount' => 6);
$stavka[] = array('start' => \Carbon\Carbon::parse('27.04.2020'), 'end' => \Carbon\Carbon::parse('21.06.2020'), 'amount' => 5.5);
$stavka[] = array('start' => \Carbon\Carbon::parse('22.06.2020'), 'end' => \Carbon\Carbon::parse('26.07.2020'), 'amount' => 4.5);
$stavka = collect($stavka);
$stavka[] = array('start' => \Carbon\Carbon::parse('27.07.2020'), 'end' => \Carbon\Carbon::now(), 'amount' => 4.25);
$stavka = collect($stavka);


$paymentPeriods = collect([
    ['text' => 'а апрель ', 'month' => '01.04.2017'],
    ['text' => 'а май ', 'month' => '01.05.2017'],
    ['text' => 'а июнь ', 'month' => '01.06.2017'],
    ['text' => 'а июль ', 'month' => '01.07.2017'],
    ['text' => 'а август ', 'month' => '01.08.2017'],
    ['text' => '(октябрь ', 'month' => '01.10.2017'],
    ['text' => '(ноябрь ', 'month' => '01.11.2017'],
    ['text' => '(декабрь ', 'month' => '01.12.2019'],
    ['text' => '(январь ', 'month' => '01.01.2020'],
])->map(function($value) {
    return ['text' => $value['text'], 'month' => \Carbon\Carbon::parse($value['month'])->endOfMonth()];
});


function getPayment(array $array) 
{
    if ($array['paid']) 
        return [
            'date' => \Carbon\Carbon::parse($array['date']),
            'amount' => (float) str_replace(',', '.', $array['paid']),
        ]; 
    else return [];
}

function getDismissalDate($users, $username)
{
    $key = $users->search(function($user) use ($username) {
        return $username == $user['name'];
    });
    if ($key === false) dd('Пользователь не найлен', $username);
    
    return $users[$key]['date'];
}

function getSalaryDate($paymentPeriods, $payment)
{
    $key = $paymentPeriods->search(function($item) use ($payment) {
        return strpos($payment['description'], $item['text']) !== false;
    });
    if ($key === false) dd('Период не найлен', $payment);
    
    return getFirstWorkedDay($paymentPeriods[$key]['month']);
}

function is_holiday(\Carbon\Carbon $date)
{
	$holidays = array(
		'01.01.2017', '02.01.2017', '03.01.2017', '04.01.2017', '05.01.2017', '06.01.2017',
		'23.02.2017', '24.02.2017',
		'08.03.2017',
		'01.05.2017', '08.05.2017', '09.05.2017',
		'12.06.2017',
		'06.11.2017',
		'01.01.2018', '02.01.2018', '03.01.2018', '04.01.2018', '05.01.2018', '08.01.2018',
		'23.02.2018',
		'01.01.2018',
		'08.03.2018', '09.03.2018',
		'30.04.2018',
		'01.05.2018', '02.05.2018', '09.05.2018',
		'11.06.2018', '12.06.2018',
		'05.11.2018',
		'31.12.2018',
		'01.01.2019', '02.01.2019', '03.01.2019', '04.01.2019', '07.01.2019', '08.01.2019',
		'08.03.2019', 
		'01.05.2019', '02.05.2019', '03.05.2019', '09.05.2019', '10.05.2019', 
		'12.06.2019', 
		'04.11.2019', 
		'01.01.2020', '02.01.2020', '03.01.2020', '06.01.2020', '07.01.2020', '08.01.2020',
		'24.02.2020',
		'09.03.2020', 
		'01.05.2020', '04.05.2020', '05.05.2020', '11.05.2020', 
		'12.06.2020', 
		'04.11.2020', 
	);
	$works = [
    	'28.04.2018', '09.06.2018', '29.12.2018',
	];
	
	if ($date->dayOfWeekIso == 6 || $date->dayOfWeekIso == 7) {
    	if (in_array($date->format('d.m.Y'), $works)) return false;
    	else return true;
	}
	else {
    	if (in_array($date->format('d.m.Y'), $holidays)) return true;
    	else return false;
	}
}

function getFirstWorkedDay(\Carbon\Carbon $date)
{
    $date = \Carbon\Carbon::parse($date->format('d.m.Y'));
    while(is_holiday($date)) {
        $date->subDay();
    }
    
    return $date;
}

function getBalance($periods, \Carbon\Carbon $date) 
{
    return collect($periods)->sortBy('date')->filter(function($period) use ($date) {
        return $period['date'] <= $date;
    })->last()['balance'];
    
}


// Собираем платежи
$payments = [];
foreach ($array as $element) {
    // коррекция алиментов
    if ($element['user'] == 'Ершова Светлана Николаевна') $element['user'] = 'Ершов Виктор Владимирович';
    $element['user'] = trim($element['user']);
    
    if ($element['amount'] != '') {
        $payments[] = [
            'amount' => (float) str_replace(',', '.', $element['amount']),
            'description' => $element['description'],
            'user' => $element['user'],
            'payments' => [getPayment($element)],
        ];
    } else $payments[count($payments) - 1]['payments'][] = getPayment($element);
}

// фильтруем платежи
$payments = collect($payments);
$payments = $payments->filter(function($value, $key){
    return ! (strpos($value['user'], 'ИФНС') !== false || strpos($value['description'], ' задержку ') !== false);
});


// проверка невозможности идентификации платежа по имени
foreach ($payments as $payment) {
    if ($users->search(function ($item, $key) use ($payment) {
        return $item['name'] == $payment['user'];
    }) === false) dd($payment);
}

$payments = $payments->all();


// определяем срок оплаты
foreach ($payments as $key => $payment) {
    $periods = [];
    /*
    $firstPartSalary = getSalaryDate($paymentPeriods, $payment);
    $payments[$key]['salaryDate'] = $firstPartSalary;
    
    $secondPartSalary = getFirstWorkedDay(\Carbon\Carbon::parse($firstPartSalary->format('d.m.Y'))->startOfMonth()->addMonth()->addDays($payment_day - 1));
    $firstPartSalary = getFirstWorkedDay($firstPartSalary);
    
    $dismissal = getDismissalDate($users, $payment['user']);
    $payments[$key]['dismissalDate'] = $dismissal;
    
    $dismissalMonth = \Carbon\Carbon::parse($dismissal->format('d.m.Y'))->startOfMonth();
    $salaryMonth = \Carbon\Carbon::parse(getSalaryDate($paymentPeriods, $payment)->format('d.m.Y'))->startOfMonth();
    

    if ($salaryMonth == $dismissalMonth) {
        if ($firstPartSalary >= $dismissal) {
            $periods[] = ['date' => $dismissal, 'balance' => $payment['amount']];
        } else {
            $periods[] = ['date' => $firstPartSalary, 'balance' => round(($payment['amount'] * $payment_proc), 2)];
            $periods[] = ['date' => $dismissal, 'balance' => $payment['amount']];
        }
    } elseif ($salaryMonth > $dismissalMonth) {
        $periods[] = ['date' => $firstPartSalary, 'balance' => $payment['amount']];
    } else {
        if ($dismissal >= $secondPartSalary) {
            $periods[] = ['date' => $firstPartSalary, 'balance' => round(($payment['amount'] * $payment_proc), 2)];
            $periods[] = ['date' => $secondPartSalary, 'balance' => $payment['amount']];
        } else {
            $periods[] = ['date' => $firstPartSalary, 'balance' => round(($payment['amount'] * $payment_proc), 2)];
            $periods[] = ['date' => $dismissal, 'balance' => $payment['amount']];
        }
    }
    */
    
    $salary = getFirstWorkedDay(getSalaryDate($paymentPeriods, $payment)->startOfMonth()->addMonth()->addDays($payment_day - 1));

    $payments[$key]['salaryDate'] = $salary;
    
    $dismissal = getDismissalDate($users, $payment['user']);
    $payments[$key]['dismissalDate'] = $dismissal;
    
    $dismissalMonth = \Carbon\Carbon::parse($dismissal->format('d.m.Y'))->startOfMonth();
    $salaryMonth = \Carbon\Carbon::parse(getSalaryDate($paymentPeriods, $payment)->format('d.m.Y'))->startOfMonth();

    if ($salaryMonth == $dismissalMonth) {
        $periods[] = ['date' => $dismissal, 'balance' => $payment['amount']];
    } elseif ($salaryMonth > $dismissalMonth) {
        $periods[] = ['date' => $salary, 'balance' => $payment['amount']];
    } else {
        if ($dismissal >= $salary) {
            $periods[] = ['date' => $salary, 'balance' => $payment['amount']];
        } else {
            $periods[] = ['date' => $dismissal, 'balance' => $payment['amount']];
        }
    }

    // получаем оплаты и расчитываем баланс
    $paids = collect($payment['payments'])->sortBy('date')->all();
    foreach ($paids as $paid) {
        if ($paid) $periods[] = ['date' => \Carbon\Carbon::parse($paid['date']->format('d.m.Y'))->addDay(), 'balance' => round((getBalance($periods, $paid['date']) - $paid['amount']), 2)];
    }
    
    $periods[] = ['date' => $from_day, 'balance' => getBalance($periods, $from_day)];
    
    
    // добавиляем периоды по ставке рефинансирования
    
    $banks = $stavka->filter(function($item) use ($periods, $end_day) {
        return $item['start'] >= $periods[0]['date'];
    });
    
    foreach ($banks as $bank) {
        $balance = getBalance($periods, $bank['start']);
        $periods[] = ['date' => $bank['start'], 'balance' => $balance];
        if ($balance == 0.01) break;
    }
    
    $periods = collect($periods)->sortBy('date')->unique();
    
    // сброс ключей
    $newPeriods = [];
    foreach ($periods as $period) {
        $newPeriods[] = $period;
    }
    $periods = $newPeriods;
    
    $payments[$key]['periods'] = $periods;
    
    
    // делаем расчет процентов
    $procs = [];
    for ($i = 0; $i < count($periods); $i++) {
        $period = $periods[$i];
        if ($period['date'] >= $from_day && $period['balance'] >= 0.01) {
            $proc = $stavka->filter(function($item) use ($period) {
                return $period['date'] >= $item['start'] && $item['end'] >= $period['date'];
            })->first()['amount'];
            
            $next = $periods[$i + 1] ?? [];
            $currentDay = $period['date'];
            $nextDay = $next ? \Carbon\Carbon::parse($next['date']->format('d.m.Y'))->subDay() : $end_day;
            
            $days = $nextDay->diffInDays($currentDay) + 1;
            
            $procs[] = [
                'start' => $currentDay->format('d.m.Y'),
                'end' => $nextDay->format('d.m.Y'),
                'days' => $days,
                'proc' => $proc,
                'amount' => round(($days * $period['balance'] * $proc / 100 / $cbr_koef), 2),
                'balance' => $period['balance'],
            ];
        }
    }
    
    $payments[$key]['procs'] = $procs;
}
    
$calculation = collect($payments)->groupBy('user');

// генерация файла 1с

$nomer = 235;
$date = \Carbon\Carbon::now()->format('d.m.Y');

$output = '1CClientBankExchange' . PHP_EOL;
$output .= 'ВерсияФормата=1.02' . PHP_EOL;
$output .= 'Кодировка=Windows' . PHP_EOL;
$output .= 'Отправитель=Бухгалтерия предприятия, редакция 2.0' . PHP_EOL;
$output .= 'Получатель=Система Клиент-Банк "BClient"' . PHP_EOL;
$output .= 'ДатаСоздания=' . $date . PHP_EOL;
$output .= 'ВремяСоздания=10:48:37' . PHP_EOL;
$output .= 'ДатаНачала=' . $date . PHP_EOL;
$output .= 'ДатаКонца=' . $date . PHP_EOL;
$output .= 'РасчСчет=40702810212000011573' . PHP_EOL;
$output .= 'Документ=Платежное поручение' . PHP_EOL;

foreach ($calculation as $user => $payments) {
    $amount = 0;
    foreach ($payments as $payment) {
        foreach($payment['procs'] as $proc) {
            $amount += $proc['amount'];
        }
    }
    
    $key = $requisites->search(function($item) use ($user) {
        return $user == $item['user'];
    });
    
    if ($key === false) dump('Реквизиты не найдены: ' . $user);
    $requisite = $requisites[$key];
    //if ($requisite['user'] == 'Седов Николай Мартьянович' || $requisite['user'] == 'Седов Евгений Николаевич') continue;
    
    $output .= 'СекцияДокумент=Платежное поручение' . PHP_EOL;
	$output .= 'Номер=' . $nomer . PHP_EOL;
	$output .= 'Дата=' . $date . PHP_EOL;
	$output .= 'Сумма='. $amount . PHP_EOL;
	$output .= 'ПлательщикСчет=40702810212000011573' . PHP_EOL;
	$output .= 'Плательщик=ИНН 3525083563 ООО Стройпластик' . PHP_EOL;
	$output .= 'ПлательщикИНН=3525083563' . PHP_EOL;
	$output .= 'Плательщик1=ООО Стройпластик' . PHP_EOL;
	$output .= 'ПлательщикРасчСчет=40702810212000011573' . PHP_EOL;
	$output .= 'ПлательщикБанк1=ВОЛОГОДСКОЕ ОТДЕЛЕНИЕ N8638 ПАО СБЕРБАНК' . PHP_EOL;
	$output .= 'ПлательщикБанк2=Г. Вологда' . PHP_EOL;
	$output .= 'ПлательщикБИК=041909644' . PHP_EOL;
	$output .= 'ПлательщикКорсчет=30101810900000000644' . PHP_EOL;
	$output .= 'ПолучательСчет=' . $requisite['bankAccount'] . PHP_EOL;
	$output .= 'Получатель=ИНН ' . $requisite['inn'] . ' ' . $requisite['user'] . PHP_EOL;
	$output .= 'ПолучательИНН=' . $requisite['inn'] . PHP_EOL;
	$output .= 'Получатель1=' . $requisite['user'] . PHP_EOL;
	$output .= 'ПолучательРасчСчет=' . $requisite['bankAccount'] . PHP_EOL;
	$output .= 'ПолучательБанк1=' . $requisite['bank'] . PHP_EOL;
	$output .= 'ПолучательБанк2=' . ($requisite['bik'] == '044030707' ? '' : 'Г. Вологда') . PHP_EOL;
	$output .= 'ПолучательБИК=' . $requisite['bik'] . PHP_EOL;
	$output .= 'ВидПлатежа=Электронно' . PHP_EOL;
	$output .= 'ВидОплаты=01' . PHP_EOL;
	$output .= 'СтатусСоставителя=' . PHP_EOL;
	$output .= 'ПлательщикКПП=352501001' . PHP_EOL;
	$output .= 'ПолучательКПП=' . PHP_EOL;
	$output .= 'ПоказательКБК=' . PHP_EOL;
	$output .= 'ОКАТО=' . PHP_EOL;
	$output .= 'ПоказательОснования=' . PHP_EOL;
	$output .= 'ПоказательПериода=' . PHP_EOL;
	$output .= 'ПоказательНомера=' . PHP_EOL;
	$output .= 'ПоказательДаты=' . PHP_EOL;
	$output .= 'ПоказательТипа=' . PHP_EOL;
	$output .= 'Очередность=2' . PHP_EOL;
	$output .= 'НазначениеПлатежа=Компенсация за задержку заработной платы за апрель 2017 года - июль 2020 года. НДС не облагается' . PHP_EOL;
	$output .= 'НазначениеПлатежа1=Компенсация за задержку заработной платы за апрель 2017 года - июль 2020 года. НДС не облагается' . PHP_EOL;
	$output .= 'Код=' . PHP_EOL;
	$output .= 'КонецДокумента' . PHP_EOL;
	
	$nomer++;
}

$output .= 'КонецФайла';

Storage::disk('reportsStorage')->put('1c_document.txt', iconv('UTF-8', 'WINDOWS-1251', $output));

$itog = 0;
@endphp
<table border="1" style="border-collapse:collapse">
@foreach($calculation as $user => $payments)
    @php
        $balanceItog = 0;
    @endphp
    <tr>
        <td>{{ $user }}</td>
        <td>{{ $payments[0]['dismissalDate']->format('d.m.Y') }}</td>
        <td>
            <table border="1" style="border-collapse:collapse" width="100%">
                @foreach ($payments as $payment)
                    <tr>
                    @php
                        $balance = 0;
                    @endphp
                        <td width="30%">{{ $payment['description'] }}</td>
                        <td>{{ number_format($payment['amount'], 2, ',', ' ') }} руб.</td>
                        <td>
                            <table border="1" style="border-collapse:collapse"  width="100%">
                            @foreach($payment['payments'] as $paid)
                                @if(! empty($paid))
                                <tr>
                                    <td>{{ $paid['date']->format('d.m.Y') }}</td>
                                    <td>{{ number_format($paid['amount'], 2, ',', ' ') }} руб.</td>
                                </tr>
                                @endif
                            @endforeach
                            </table>
                        </td>
                        <td>
                            <table border="1" style="border-collapse:collapse"  width="100%">
                                @foreach($payment['procs'] as $proc)
                                    @if($proc['balance'] >= 0.01)
                                        @php
                                            $balance += $proc['amount'];
                                        @endphp
                                        <tr>
                                            <td>{{ $proc['start'] }} - {{ $proc['end'] }}</td>
                                            <td>{{ $proc['days'] }}</td>
                                            <td>{{ $proc['proc'] }}%</td>
                                            <td>{{ number_format($proc['balance'], 2, ',', ' ') }} руб.</td>
                                            <td>{{ number_format($proc['amount'], 2, ',', ' ') }} руб.</td>
                                        </tr>
                                    @endif
                                @endforeach
                                <tr>
                                    <td colspan="4">Итого</td>
                                    <td>{{ number_format($balance, 2, ',', ' ') }} руб.</td>
                                </tr>
                                @php
                                    $balanceItog += $balance;
                                @endphp
                            </table>
                        </td>
                    </tr>
                @endforeach
            </table>
        </td>
        <td>{{ number_format($balanceItog, 2, ',', ' ') }} руб.</td>
    </tr>
    @php
        $itog += $balanceItog;
    @endphp
@endforeach
</table>
<p>Всего - {{ number_format($itog, 2, ',', ' ') }} руб.</p>
