@php

$users[] = ['iterator' => '1', 'id' => '1', 'users' => 'Куликов Андрей Юрьевич | Куликова Ирина Александровна'];
$users[] = ['iterator' => '2', 'id' => '2', 'users' => 'Попова Ирина Вячеславовна'];
$users[] = ['iterator' => '3', 'id' => '3', 'users' => 'Емельянов Николай Викторович'];
$users[] = ['iterator' => '4', 'id' => '4', 'users' => 'Мосина Екатерина Александровна | Андреева Елизавета Александровна'];
$users[] = ['iterator' => '5', 'id' => '5', 'users' => 'Помощников Федор Геннадьевич'];
$users[] = ['iterator' => '6', 'id' => '6', 'users' => 'Будзинский Денис Леонидович'];
$users[] = ['iterator' => '7', 'id' => '7', 'users' => 'Кузнецова Ольга Викентьевна'];
$users[] = ['iterator' => '8', 'id' => '8', 'users' => 'Козлова Мария Леонидовна | Козлов Алексей Сергеевич'];
$users[] = ['iterator' => '9', 'id' => '9', 'users' => 'Лобанова Анна Николаевна'];
$users[] = ['iterator' => '10', 'id' => '10', 'users' => 'Абрамова Анна Васильевна'];
$users[] = ['iterator' => '11', 'id' => '11', 'users' => 'Петрова Нина Ивановна'];
$users[] = ['iterator' => '12', 'id' => '12', 'users' => 'Лобанов Олег Константинович | Лобанова Елена Геннадьевна'];
$users[] = ['iterator' => '13', 'id' => '13', 'users' => 'Кондауров Александр Юрьевич'];
$users[] = ['iterator' => '14', 'id' => '14', 'users' => 'Садова Марина Анастасовна | Садов Александр Валентинович'];
$users[] = ['iterator' => '15', 'id' => '15', 'users' => 'Крылова Галина Владимировна'];
$users[] = ['iterator' => '16', 'id' => '16', 'users' => 'Потеряев Максим Александрович'];
$users[] = ['iterator' => '17', 'id' => '17', 'users' => 'Вороничева Анна Сергеевна'];
$users[] = ['iterator' => '18', 'id' => '18', 'users' => 'Буров Александр Владимирович | Бурова Юлия Борисовна'];
$users[] = ['iterator' => '19', 'id' => '19', 'users' => 'Ефремова Наталия Григорьевна'];
$users[] = ['iterator' => '20', 'id' => '20', 'users' => 'Костыгина Ксения Геннадьевна | Костыгин Антон Николаевич'];
$users[] = ['iterator' => '21', 'id' => '21', 'users' => 'Бондаренко Татьяна Витальевна'];
$users[] = ['iterator' => '22', 'id' => '22', 'users' => 'Карповская (Шохина) Ирина Вадимовна'];
$users[] = ['iterator' => '23', 'id' => '23', 'users' => 'Яковлев Игорь Владимирович | Яковлева Светлана Викторовна'];
$users[] = ['iterator' => '24', 'id' => '24', 'users' => 'Земцова Наталья Валерьевна'];
$users[] = ['iterator' => '25', 'id' => '25', 'users' => 'Косарев Максим Валериевич'];
$users[] = ['iterator' => '26', 'id' => '26', 'users' => 'Сипачева (Штанова) Ольга Геннадьевна'];
$users[] = ['iterator' => '27', 'id' => '27', 'users' => 'Малафеев Александр Константинович'];
$users[] = ['iterator' => '28', 'id' => '28', 'users' => 'Маркин Дмитрий Владимирович'];
$users[] = ['iterator' => '29', 'id' => '29', 'users' => 'Зотова Вера Алексеевна'];
$users[] = ['iterator' => '30', 'id' => '30', 'users' => 'Кузнецова Полина Александровна | Кузнецова Ксения Андреевна | Филимонова-Хухка Дарья Михайловна'];
$users[] = ['iterator' => '31', 'id' => '31', 'users' => 'Вечеринина Светлана Юрьевна'];
$users[] = ['iterator' => '32', 'id' => '32', 'users' => 'Цветкова Юлия Сергеевна'];
$users[] = ['iterator' => '33', 'id' => '33', 'users' => 'Михайлов Николай Игоревич | Михайлова Екатерина Александровна'];
$users[] = ['iterator' => '34', 'id' => '34', 'users' => 'Медянкина Наталия Владимировна | Медянкина Нина Вячеславовна'];
$users[] = ['iterator' => '35', 'id' => '35', 'users' => 'Спирина Юлия Ивановна | Клюшенкова Анастасия Вячеславовна | Спирин Иван Юрьевич'];
$users[] = ['iterator' => '36', 'id' => '36', 'users' => 'Трандин Алексей Николаевич | Трандина Вероника Александровна'];
$users[] = ['iterator' => '37', 'id' => '37', 'users' => 'Ефимов Андрей Александрович'];
$users[] = ['iterator' => '38', 'id' => '38', 'users' => 'Чащина Валентина Ивановна | Чащина Екатерина Анатольевна'];
$users[] = ['iterator' => '39', 'id' => '39', 'users' => 'Спивак Игорь Юрьевич'];
$users[] = ['iterator' => '40', 'id' => '40', 'users' => 'Сидченко Татьяна Вячеславовна'];
$users[] = ['iterator' => '41', 'id' => '41', 'users' => 'Попов Александр Вячеславович | Попова Юлия Валерьевна'];
$users[] = ['iterator' => '42', 'id' => '42', 'users' => 'Гладцинова Людмила Викторовна'];
$users[] = ['iterator' => '43', 'id' => '43', 'users' => 'Скрябин Константин Валерьевич | Скрябина Екатерина Николаевна'];
$users[] = ['iterator' => '44', 'id' => '44', 'users' => 'Солнцев Александр Викторович'];
$users[] = ['iterator' => '45', 'id' => '45', 'users' => 'Гарамова Светлана Владимировна'];
$users[] = ['iterator' => '46', 'id' => '46', 'users' => 'Брагинов Евгений Владимирович'];
$users[] = ['iterator' => '47', 'id' => '47', 'users' => 'Прокопова Елена Сергеевна'];
$users[] = ['iterator' => '48', 'id' => '48', 'users' => 'Шарыпина Ирина Ивановна'];
$users[] = ['iterator' => '49', 'id' => '49', 'users' => 'Хитилова Юлия Геннадьевна'];
$users[] = ['iterator' => '50', 'id' => '50', 'users' => 'Володина Виктория Евгеньевна'];
$users[] = ['iterator' => '51', 'id' => '51', 'users' => 'Темралеева Елена Викторовна'];
$users[] = ['iterator' => '52', 'id' => '52', 'users' => 'Борисов Евгений Сергеевич | Борисова Юлия Александровна'];
$users[] = ['iterator' => '53', 'id' => '53', 'users' => 'Анисимова (Загдай) Яна Викторовна'];
$users[] = ['iterator' => '54', 'id' => '54', 'users' => 'Сычев Виктор Борисович'];
$users[] = ['iterator' => '55', 'id' => '55', 'users' => 'Брызгалов Роман Александрович'];
$users[] = ['iterator' => '56', 'id' => '56', 'users' => 'Ефимова Любовь Андреевна'];
$users[] = ['iterator' => '57', 'id' => '57', 'users' => 'Базлеев Евгений Николаевич | Базлеева Анна Николаевна'];
$users[] = ['iterator' => '58', 'id' => '58', 'users' => 'Андреева Алена Сергеевна | Андреев Александр Николаевич'];
$users[] = ['iterator' => '59', 'id' => '59', 'users' => 'Сковородников Николай Павлович | Сковородникова Евгения Александровна'];
$users[] = ['iterator' => '60', 'id' => '60', 'users' => 'Лоскутова (Яблокова) Алена Алексеевна'];
$users[] = ['iterator' => '61', 'id' => '61', 'users' => 'Гришичева Наталия Геннадьевна'];
$users[] = ['iterator' => '62', 'id' => '62', 'users' => 'Винярский Александр Сергеевич'];
$users[] = ['iterator' => '63', 'id' => '63', 'users' => 'Гребнева Надежда Валериевна'];
$users[] = ['iterator' => '64', 'id' => '64', 'users' => 'Збродов Сергей Александрович'];
$users[] = ['iterator' => '65', 'id' => '65', 'users' => 'Мамаев Дмитрий Владимирович'];
$users[] = ['iterator' => '66', 'id' => '66', 'users' => 'Зернова Екатерина Ивановна'];
$users[] = ['iterator' => '67', 'id' => '67', 'users' => 'Амосов Алексей Анатольевич | Амосова Марина Михайловна'];
$users[] = ['iterator' => '68', 'id' => '68', 'users' => 'Рябкина Екатерина Борисовна | Кармазиков Константин Игоревич'];
$users[] = ['iterator' => '69', 'id' => '69', 'users' => 'Гусев Николай Анатольевич | Гусева Елена Анатольевна'];
$users[] = ['iterator' => '70', 'id' => '70', 'users' => 'Семыкин Николай Сергеевич | Семыкина Татьяна Владимировна'];
$users[] = ['iterator' => '71', 'id' => '71', 'users' => 'Тимонина Жанна Владимировна'];
$users[] = ['iterator' => '72', 'id' => '72', 'users' => 'Попова Лилия Дмитриевна'];
$users[] = ['iterator' => '73', 'id' => '73', 'users' => 'Тяжелова Лариса Геннадьевна'];
$users[] = ['iterator' => '74', 'id' => '74', 'users' => 'Теплякова Любовь Анатольевна'];
$users[] = ['iterator' => '75', 'id' => '75', 'users' => 'Вятчанинова Наталья Александровна'];
$users[] = ['iterator' => '76', 'id' => '76', 'users' => 'Кустовлянкина Анастасия Николаевна'];
$users[] = ['iterator' => '77', 'id' => '77', 'users' => 'Табунов Александр Константинович | Табунов Иван Александрович | Табунов Павел Александрович | Табунова Нелли Игоревна | Табунов Андрей Александрович'];
$users[] = ['iterator' => '78', 'id' => '78', 'users' => 'Парушевой Галины Васильевны'];
$users[] = ['iterator' => '79', 'id' => '79', 'users' => 'Панева Надежда Анатольевна'];
$users[] = ['iterator' => '80', 'id' => '80', 'users' => 'Шиловец Татьяна Олеговна'];
$users[] = ['iterator' => '81', 'id' => '81', 'users' => 'Михайлов Евгений Александрович'];
$users[] = ['iterator' => '82', 'id' => '82', 'users' => 'Бабушкина Татьяна Олеговна'];
$users[] = ['iterator' => '83', 'id' => '83', 'users' => 'Коновалова Алена Вячеславовна'];
$users[] = ['iterator' => '84', 'id' => '84', 'users' => 'Матюшин Василий Леонидович'];
$users[] = ['iterator' => '85', 'id' => '85', 'users' => 'Кувалдин Юрий Александрович'];
$users[] = ['iterator' => '86', 'id' => '86', 'users' => 'Никонюк Павел Евгеньевич | Никонюк Анна Валерьевна'];
$users[] = ['iterator' => '87', 'id' => '87', 'users' => 'Общество с ограниченной ответственностью «СК Комплекс»'];
$users[] = ['iterator' => '88', 'id' => '88', 'users' => 'Артимович Марина Владимировна'];
$users[] = ['iterator' => '89', 'id' => '89', 'users' => 'Березина Елена Валентиновна'];
$users[] = ['iterator' => '90', 'id' => '90', 'users' => 'ООО "ДОБРОДЕЛ"'];
$users[] = ['iterator' => '91', 'id' => '91', 'users' => 'Веткина Вероника Владимировна'];
$users[] = ['iterator' => '92', 'id' => '92', 'users' => 'Стацюк Елена Геннадьевна | Стацюк Виталий Николаевич'];
$users[] = ['iterator' => '93', 'id' => '93', 'users' => 'Бражкин Николай Петрович | Бражкина Галина Михайловна | Бражкин Вячеслав Константинович | Бражкин Николай Константинович'];
$users[] = ['iterator' => '94', 'id' => '94', 'users' => 'Сахарусова Валерия Константиновна | Бражкин Вячеслав Константинович | Бражкин Николай Константинович'];
$users[] = ['iterator' => '95', 'id' => '95', 'users' => 'Бражкина Наталия Игоревна | Бражкин Вячеслав Константинович | Бражкин Николай Константинович'];
$users[] = ['iterator' => '96', 'id' => '96', 'users' => 'Сахарусова Валерия Константиновна | Бражкин Вячеслав Константинович | Бражкин Николай Константинович'];
$users[] = ['iterator' => '97', 'id' => '97', 'users' => 'Сахарусова Валерия Константиновна | Бражкин Вячеслав Константинович | Бражкин Николай Константинович'];
$users[] = ['iterator' => '98', 'id' => '98', 'users' => 'Бражкин Вячеслав Константинович | Бражкин Николай Константинович'];
$users[] = ['iterator' => '99', 'id' => '99', 'users' => 'Сахарусова Валерия Константиновна | Бражкин Вячеслав Константинович | Бражкин Николай Константинович'];
$users[] = ['iterator' => '100', 'id' => '100', 'users' => 'Бражкин Николай Петрович | Бражкина Галина Михайловна | Бражкин Вячеслав Константинович | Бражкин Николай Константинович'];
$users[] = ['iterator' => '101', 'id' => '101', 'users' => 'Бражкин Николай Петрович | Бражкина Галина Михайловна | Бражкин Вячеслав Константинович | Бражкин Николай Константинович'];
$users[] = ['iterator' => '102', 'id' => '102', 'users' => 'Колошин Олег Валериевич'];
$users[] = ['iterator' => '103', 'id' => '103', 'users' => 'Фальковская Людмила Васильевна'];
$users[] = ['iterator' => '104', 'id' => '104', 'users' => 'Антипов Николай Владимирович | Антипова Галина Викторовна | Антипов Олег Николаевич | Антипов Михаил Николаевич'];
$users[] = ['iterator' => '105', 'id' => '105', 'users' => 'Кириллова Ольга Валентиновна'];
$users[] = ['iterator' => '106', 'id' => '106', 'users' => 'Миронов Иван Геннадьевич'];
$users[] = ['iterator' => '107', 'id' => '107', 'users' => 'Кудряшова Ольга Брониславовна'];
$users[] = ['iterator' => '108', 'id' => '108', 'users' => 'Карпухина Инна Евгеньевна'];
$users[] = ['iterator' => '109', 'id' => '109', 'users' => 'Шумский Дмитрий Вячеславович'];
$users[] = ['iterator' => '110', 'id' => '110', 'users' => 'Носова Виктория Александровна'];
$users[] = ['iterator' => '111', 'id' => '111', 'users' => 'Общество с ограниченной ответственностью «ПРЕМЬЕР ОЙЛ»'];
$users[] = ['iterator' => '112', 'id' => '112', 'users' => 'Веселов Иван Сергеевич'];
$users[] = ['iterator' => '113', 'id' => '113', 'users' => 'Головатых Сергей Александрович'];
$users[] = ['iterator' => '114', 'id' => '114', 'users' => 'Елсукова Наталия Анатольевна'];
$users[] = ['iterator' => '115', 'id' => '115', 'users' => 'Поленов Владимир Борисович'];
$users[] = ['iterator' => '116', 'id' => '116', 'users' => 'Общество с ограниченной ответственностью «СеверТрансСервис»'];
$users[] = ['iterator' => '117', 'id' => '117', 'users' => 'Орлов Евгений Павлович'];
$users[] = ['iterator' => '118', 'id' => '118', 'users' => 'Баженов Игорь Владимирович'];
$users[] = ['iterator' => '119', 'id' => '119', 'users' => 'Маслова Арина Игоревна'];
$users[] = ['iterator' => '120', 'id' => '120', 'users' => 'Синцова Ирина Валерьевна'];
$users[] = ['iterator' => '121', 'id' => '121', 'users' => 'ООО «Новый Порт»'];
$users[] = ['iterator' => '122', 'id' => '122', 'users' => 'Капустин Владимир Борисович'];
$users[] = ['iterator' => '123', 'id' => '123', 'users' => 'Тихомиров Александр Николаевич'];
$users[] = ['iterator' => '124', 'id' => '124', 'users' => 'Кленова Татьяна Александровна'];



$kreditors = [];

foreach ($users as $item) {
    $currentUsers = explode(' | ', $item['users']);
    foreach ($currentUsers as $user) {
        $kreditors[] = [
            'iterator' => $item['iterator'],
            'id' => $item['id'],
            'user' => $user,
        ];
    }
}

$kreditors = collect($kreditors)->sortBy('user')->groupBy('user');

foreach ($kreditors as $kreditor) {
    //if (count(explode(' ', $kreditor)) > 3) dump($kreditor);
}

@endphp

<table border="1" style="border-collapse: collapse">
  @foreach($kreditors as $kreditor)
  <tr>
     <td>{{ $kreditor[0]['iterator'] }}</td>
     <td>{{ $kreditor[0]['id'] }}</td>
     <td>{{ $kreditor[0]['user'] }}</td>
  </tr>
  @endforeach
</table>